[
  {
    "url": "https://timesofindia.indiatimes.com/world/south-asia/nepal-interim-govt-sushila-karki-takes-oath-as-pm-first-woman-in-top-post/articleshow/123854804.cms",
    "title": "Nepal interim govt: Sushila Karki takes oath as PM; first woman in top post",
    "content": "Sushila Karki takes oath as Nepal PMNEW DELHI: Sushila Karki on Friday took the oath as Nepal's interim Prime Minister and is set to lead the government, days after the neighbouring nation witnessed massive violent protests against the KP Sharma Oli dispensation.Nepal's president Ramchandra Paudel administered the oath of office of secrecy to Karki at a ceremony at Sheetal Niwas, which is the President’s Office. Sushila Karki Sworn In as Nepal’s Interim Prime MinisterThe government has been mandated to hold elections within six months.Karki, an alumna of Banaras Hindu University (BHU) in India, was among four candidates before being finally selected following consultations involving President Poudel, Army chief General Ashok Raj Sigdel, and representatives of the youth demonstrators, dubbed “Gen Z.”Also in the running were former Nepal Electricity Authority chief Kulman Ghising, Kathmandu mayor Balendra Shah, and Dharan mayor Harka Sampang.The \"Gen Z\" protests, initially sparked by a controversial social media ban, escalated into a broader rejection of corruption, nepotism and entrenched political elites. Soldiers remain deployed across Kathmandu after demonstrators torched government buildings, politicians’ residences and the parliament.Who is Sushila Karki?Sushila Karki made history in July 2016 when she became Nepal’s first female chief justice. Her tenure, however, ended less than a year later after lawmakers filed an impeachment motion accusing her of “delivering biased verdicts” and \"interfering\" in executive jurisdiction.The move followed a Nepal Supreme Court ruling that struck down the government’s decision on police chief appointments, saying seniority had been unfairly bypassed.Although automatically suspended while the probe was pending, the impeachment failed to secure the two-thirds majority required before her retirement in June 2017. Who is Shushila KarkiBorn on June 7, 1952, in Biratnagar, the ex-jurist studied political science at BHU in 1975 and law at Tribhuvan University in 1978. Before becoming chief justice, she served as a Supreme Court justice, senior advocate and law professor. She is also an author on gender equality and has long been involved in human rights and women’s judicial organisations.Karki has been recognised with awards including the Sambhav Kanoon Puraskar (2004).ALSO READ | Why Nepal unrest looks familiar: Parallels with Bangladesh, Sri Lanka, and fears of a larger plot"
  },
  {
    "url": "https://timesofindia.indiatimes.com/toi-plus/law/30-acres-3750cr-grand-old-style-what-mumbais-new-hc-complex-in-bandra-will-look-like/articleshow/123826690.cms",
    "title": "30 acres, ₹3,750cr, grand old style: What Mumbai's new HC complex in Bandra will look like",
    "content": "Conceptualised by renowned architect Hafeez Contractor, the new high court will boast a built-up area of 60 lakh sq ft, or 138 acres, equivalent to six Oval MaidansThe design for the new Bombay High Court complex, to come up on 30 acres in Mumbai's Bandra (East) at an estimated Rs 3,750 crore, has been selected and is being finalised. The plan, submitted by renowned architect Hafeez Contractor, was chosen by the high court’s steering committee through a competition, according to the public works department (PWD). The state cabinet had in June cleared free land transfer to the PWD, waiving Rs 31.8 crore."
  },
  {
    "url": "https://timesofindia.indiatimes.com/world/us/chilling-discord-gun-casings-how-authorities-confirmed-tyler-robinson-as-charlie-kirks-killer/articleshow/123855122.cms",
    "title": "Chilling! Discord & gun casings - How authorities confirmed Tyler Robinson as Charlie Kirk's killer",
    "content": "Authorities say a series of digital messages, unusual bullet casings and campus surveillance footage led them to identify 22-year-old Tyler Robinson as the man behind the assassination of conservative activist Charlie Kirk. Robinson was taken into custody in Utah after days of intense investigation and public appeals.Utah Governor Spencer Cox said Robinson’s own online activity provided a key breakthrough. His roommate gave investigators access to Discord, a popular messaging app, where Robinson had allegedly discussed retrieving and concealing a rifle. “The content included references to leaving the rifle in a bush, wrapping it in a towel, watching the area, and even engraving bullets,” Cox told reporters. Investigators photographed the incriminating messages directly from the device.Charlie Kirk’s Casket Returns Home: Erika Kirk’s First Public Appearance Drenched In GriefMessages, casings and a riflePolice later recovered a bolt-action rifle wrapped in a towel near the scene. Three unfired casings were found with the weapon, carrying chilling inscriptions: “Hey, fascist! Catch!” alongside arrow symbols. Cox confirmed the bullets appeared to have been engraved in advance, matching details from the Discord exchanges.Surveillance footage from Utah Valley University showed Robinson arriving in a Dodge Challenger on the morning of the attack. He was seen in a maroon T-shirt, shorts, a black hat and light shoes — clothing consistent with what he wore when investigators encountered him the following day.Family members told investigators Robinson had spoken negatively of Kirk in the weeks before the shooting. At a family dinner, he allegedly mentioned the activist’s upcoming appearance at UVU and criticised his views. Cox said Robinson had grown more political in recent years and was increasingly hostile to conservative figures.Arrest and reactionPresident Donald Trump confirmed the arrest during a Fox News interview, calling it a “significant breakthrough” in a case he described as a “political assassination.” He said a close acquaintance of Robinson had identified him and turned him in. “With a high degree of certainty, we have him,” Trump said.Kirk, 31, co-founder of Turning Point USA, was shot once while addressing students at UVU on Wednesday. He died later in hospital. The FBI and state officials said the attack was targeted, sparking fresh alarms over political violence in America.Grisly footage of the shooting, widely shared online, showed Kirk collapsing after being struck in the neck. More than 7,000 tips poured into investigators before Robinson’s arrest.Vice President JD Vance, who visited Kirk’s family, called him a “friend and organiser who shaped this administration.” Trump said Kirk would be posthumously awarded the Presidential Medal of Freedom."
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/amazon-suspends-engineer-who-sent-threatening-letter-to-ceo-andy-jassy-saying-i-am-left-with-no-choice-but-to-/articleshow/123849551.cms",
    "title": "Amazon suspends engineer who sent 'threatening' letter to CEO Andy Jassy, saying: I am left with no choice but to….",
    "content": "File image: AmazonAmazon has suspended a Palestinian software engineer who criticized the company's business ties with Israel through internal communications, according to CNBC reports. Ahmed Shahrour, who works for Amazon's Whole Foods division in Seattle, was placed on paid suspension following posts on company Slack channels and a letter to executives including CEO Andy Jassy.“It has come to Amazon’s attention that a post you made in multiple internal company Slack channels may violate multiple policies,” Shahrour received in a message from an Amazon HR rep, per CNBC. The company, as per the message, is said to be investigating the matter. The suspension centres on Shahrour's opposition to Project Nimbus, a $1.2 billion joint cloud computing contract between Amazon, Google, and the Israeli government launched in 2021. In his letter to leadership, the three-year Amazon employee described living in \"constant dissonance\" while writing code for a company whose profits he believes support Israeli actions in Gaza.Suspended engineer says Amazon targets pro-Palestinian voicesShahrour alleges Amazon has systematically suppressed pro-Palestinian employee voices, claiming the company recently warned an engineer for sharing articles about American doctors volunteering in Gaza and terminated a French employee for social media criticism of Israel. He also reports selective content moderation in workplace channels, with pro-Palestinian discussions removed from \"Arabs at Amazon\" groups while anti-Palestinian posts remain visible elsewhere.Amazon spokesperson Brad Glasser declined to address Shahrour's specific case but said the company doesn't \"tolerate discrimination, harassment, or threatening behavior or language of any kind.\" The company revoked Shahrour's access to email and tools while conducting its investigation.Similar protests hit Google, Microsoft also Shahrour's suspension follows a wave of employee terminations at other major tech companies over Israel-related protests. Microsoft fired four workers in August 2025 after they demonstrated at company headquarters, including two who staged a sit-in at President Brad Smith's office. The terminated employees were part of the \"No Azure for Apartheid\" campaign demanding Microsoft cut ties with Israel. Protests were also seen at the company's 50th anniversary celebration.Google took similar action earlier, terminating 28 employees in April 2024 following coordinated protests against Project Nimbus at the company's offices. The demonstrations targeted both the Israeli government contract and internal labor conditions. The two companies have since increased security measures at their offices and conferences.OnePlus Nord Buds 3r Review: Affordable TWS With Long Battery Life"
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/cricket/pakistan-vs-oman-live-score-today-cricket-match-updates-pak-vs-oma-asia-cup-2025-live-scorecard-salman-agha-jatinder-singh/liveblog/123853098.cms",
    "title": "Pakistan vs Oman Highlights, Asia Cup 2025: Pakistan win by 93 runs, humiliate Oman ahead of India clash",
    "content": "NewsSports NewsCricket NewsPakistan vs Oman Highlights, Asia Cup 2025: Pakistan win by 93 runs, humiliate Oman ahead of India clashTHE TIMES OF INDIA | Sep 13, 2025, 00:18:18 ISTPakistan asserted their dominance early in the Asia Cup with a commanding 93-run victory over Oman in the Group A opener at Dubai International Cricket Stadium on Friday. A composed half-century from Mohammad Haris and a ruthless bowling display secured a comfortable start for the former champions.   Opting to bat first, Pakistan endured a shaky beginning as opener Saim Ayub fell for a golden duck to Shah Faisal. However, Haris and Sahibzada Farhan steadied the innings with a crucial 84-run partnership. Haris struck freely, hitting seven fours and three sixes in his 43-ball 66, while Farhan contributed a patient 29. Haris reached his maiden T20I half-century in 32 deliveries, but Oman’s bowlers pulled things back.   Veteran Aamir Kaleem dismissed both Farhan and Haris in successive overs before accounting for captain Salman Agha. Faisal added to Pakistan’s troubles by removing Hasan Nawaz and Mohammad Nawaz, ensuring the batting side could not accelerate. Fakhar Zaman’s unbeaten 23 off 16 balls gave Pakistan a final push to 160/7. Kaleem (3/31) and Faisal (3/34) were the standout performers for Oman, with Shakeel Ahmed maintaining pressure through his economical four overs.   Chasing 161, Oman’s top order crumbled under pressure. Ayub struck early to remove skipper Jatinder Singh and Aamir Kaleem, while Muqeem and Nawaz made further inroads. A direct hit from Shaheen Afridi ran out wicketkeeper Vinayak Shukla, and Oman’s hopes faded when Muqeem dismissed the dangerous Mirza for 27. The innings collapsed swiftly, with Oman bowled out for 67 in 16.4 overs.   Pakistan’s attack shared the spoils, with Muqeem, Ayub, and Faheem Ashraf taking two wickets each. Afridi, Abrar Ahmed, and Nawaz claimed one apiece in a clinical performance.   The win handed Pakistan early momentum ahead of their high-stakes clash against India on Sunday, while Oman, despite promising spells with the ball, were comprehensively outplayed on their Asia Cup debut.   Live Cricket Score | Asia Cup 2025Commentary Scorecard 23:49 (IST) Sep 12Right then, that is it from this game and so far, we have seen 4 fairly one-sided games and this was somewhat expected as well, given the fixtures. However, the first weekend of the 2025 Asia Cup is about to bring a couple of big clashes, starting with Sri Lanka vs Bangladesh on Saturday, 13 September and that game will begin at 2.30 pm GMT. The Lankan Lions vs the Bangla Tigers is a brewing rivalry in cricket and it should be an exciting watch, so do join us early for the build-up as well. Cheers!23:47 (IST) Sep 12Salman Agha, the captain of Pakistan, says that they were pretty good with the ball, but still need to improve with the bat. Adds that they don't mind playing with the spinners and they are different and Saim Ayub can chip in as well. Mentions that they should have gotten 180 with the start they got. Says that they have been playing good cricket in the last 2-3 months, and if they execute their plans, they can beat any team in the world.23:45 (IST) Sep 12The Oman skipper, Jatinder Singh, says that restricting Pakistan to 160 was very good and is proud of the boys. Goes on to add that the boys executed the plans brilliantly with the ball but also mentions that their batters failed to hold their nerves and reckons that they are better than what they showed today. Adds that they are looking forward to the next game and want to keep a positive mindset.23:44 (IST) Sep 12Mohammad Haris is the PLAYER OF THR MATCH for his fine knock. He says that it is a great feeling and it was a crucial win. Adds that the pitch looked flat, but it wasn't easy. Mentions that he is happy to bat anywhere according to the needs of the team. Ends by saying that he just wants to get on with the bat and the skipper also want them to be positive all the time.23:37 (IST) Sep 12The Presentation ceremony...23:32 (IST) Sep 12Earlier in the game, Pakistan won the toss and Salman Agha opted to bat first, as opposed to what India did against a minnow. The idea for Pakistan was to go hard with the bat but they lost Saim Ayub very early in the piece. However, Mohammad Haris who was promoted back to his favored number 3 position, managed to up the ante and brought up a fiery 50 as Sahibzada Farhan continued to play second fiddle. But once Haris got out, Oman capitalized and their bowlers, led by Aamir Kaleem and Shah Faisal, kept on picking up wickets at regular intervals and held Pakistan down to a not-so-big total of 160.23:30 (IST) Sep 12This is Oman's 2nd lowest T20I total, their lowest being 47 against England in last year's T20 World Cup but again, this will be another learning curve for the associate nation. They did lose a wicket in the second over but for a few minutes, things started to look positive as Aamir Kaleem and Hammad Mirza took on Pakistan's premier pacer Shaheen Afridi. However, the Oman batters did not have much of an answer to the opposition spinners and kept on losing wickets in a heap. Mirza was the only bright spark with a knock of 27, whereas Kaleem was the only other batter who even got into double figures until Shakeel Ahmed managed to hit a six just before getting out and got to 10 runs.23:28 (IST) Sep 12Not often do we see Pakistan play more than two spinners, but they played 3 proper spinners in this game and also had Saim Ayub as a very handy option. And it was Ayub who picked up a couple of early wickets to get the ball rolling. Sufiyan Muqeem and his left-arm wrist spin were too good for the opposition and even though Abrar Ahmed didn't get a wicket to begin with, he too bowled well and picked up the final wicket of the game. Shaheen Afridi, playing as the single frontline pacer, did get a wicket late in the game as Faheem Ashraf picked up two, and overall, it was a happy day for Pakistan in the field.23:26 (IST) Sep 12A rollicking win for Pakistan and this is just the start they would have wanted heading into that big clash against India in a couple of days' time. They did falter with the blade, but the bowlers were on song and have made light work of the Oman lineup here.23:24 (IST) Sep 12WOvers16.4Score67 - 10 Abrar Ahmed to Shakeel Ahmed, OUT! TAKEN! DONE AND DUSTED! Abrar Ahmed wraps things! He tosses up the leggie, full and on off, turns in. Shakeel Ahmed comes down the track to repeat the dose but this time fails to get near the pitch of the ball and mistimes it straight towards long off. Shaheen Afridi comes forward a bit and takes a fine catch. PAKISTAN WIN BY 93 RUNS!23:24 (IST) Sep 120Overs16.3Score67 - 9 Abrar Ahmed to Shakeel Ahmed, Flighted, full and on middle and leg, Shakeel Ahmed nudges it to short mid-wicket.23:23 (IST) Sep 126Overs16.2Score67 - 9 Abrar Ahmed to Shakeel Ahmed, SIX! Finally takes his chance! Tossed up, full and on off, Shakeel Ahmed skips down the track, gets to the pitch of it and tonks it over the long off fence for a biggie.23:23 (IST) Sep 120Overs16.1Score61 - 9 Abrar Ahmed to Shakeel Ahmed, Googly, short and on off, turns away, Shakeel Ahmed pushes it towards short covers.23:22 (IST) Sep 12Score after 16 overs 61 - 9Runs Scored: 0 110001Shakeel Ahmed 4 (19)Samay Shrivastava 5 (11)Sufiyan Muqeem3-0-7-21Overs15.6Score61 - 9 Sufiyan Muqeem to Shakeel Ahmed, Darts this one full and on middle, Shakeel Ahmed taps it to the off side for a quick single. Mohammad Haris, the keeper runs forward to his left, collects it and has a shy at the bowler's end but misses.Don't missanything!Subscribe to our newsletter and get all the stories that matter delivered to your inboxInvalid id. Please enter again23:22 (IST) Sep 120Overs15.5Score60 - 9 Sufiyan Muqeem to Shakeel Ahmed, Drags his length back, on middle, Shakeel Ahmed moves back and punches it to short covers.23:22 (IST) Sep 120Overs15.4Score60 - 9 Sufiyan Muqeem to Shakeel Ahmed, Quicker, short and outside off, Shakeel Ahmed tries to cut it away but misses.23:21 (IST) Sep 120Overs15.3Score60 - 9 Sufiyan Muqeem to Shakeel Ahmed, Flatter, full and on middle, Shakeel Ahmed knocks it back to the bowler.23:21 (IST) Sep 121Overs15.2Score60 - 9 Sufiyan Muqeem to Samay Shrivastava, Goes short and around off, Samay Shrivastava stabs it out towards extra covers for a run.23:21 (IST) Sep 121Overs15.1Score59 - 9 Sufiyan Muqeem to Shakeel Ahmed, Flighted, full and around off, Shakeel Ahmed steers it throughj point for a single.23:20 (IST) Sep 12Score after 15 overs 58 - 9Runs Scored: 0 010000Samay Shrivastava 4 (10)Shakeel Ahmed 2 (14)Abrar Ahmed3-1-6-00Overs14.6Score58 - 9 Abrar Ahmed to Samay Shrivastava, Another googly, short and on middle, turns in, Samay Shrivastava stays back and manages to tuck it towards square leg. Oman is just delaying the inevitable here!23:19 (IST) Sep 120Overs14.5Score58 - 9 Abrar Ahmed to Samay Shrivastava, Flighted, full and on off, Samay Shrivastava pushes it to covers.23:19 (IST) Sep 120Overs14.4Score58 - 9 Abrar Ahmed to Samay Shrivastava, Wrong'un, short and around off, Samay Shrivastava moves across to cut but gets gets an inside edge that just goes past the stumps.23:19 (IST) Sep 120Overs14.3Score58 - 9 Abrar Ahmed to Samay Shrivastava, Slows it up, full and on middle, does not turn much, Samay Shrivastava prods forward and fends it off the inner half of the bat to the leg side.23:18 (IST) Sep 121Overs14.2Score58 - 9 Abrar Ahmed to Shakeel Ahmed, Tossed up, full and around off, Shakeel Ahmed scythes it down to long off for a single.23:18 (IST) Sep 120Overs14.1Score57 - 9 Abrar Ahmed to Shakeel Ahmed, Floated, short and around off, Shakeel Ahmed stabs it out to short covers.23:17 (IST) Sep 12Score after 14 overs 57 - 9Runs Scored: 0 000010Samay Shrivastava 4 (6)Shakeel Ahmed 1 (12)Shaheen Afridi4-0-20-10Overs13.6Score57 - 9 Shaheen Afridi to Samay Shrivastava, Swing and a miss! Goes around the wicket and serves this full, on off, Samay Shrivastava makes room and has a wild swing at it but fails to connect. Afridi has his hands on his face as this was inches away from the off stump again.23:16 (IST) Sep 121Overs13.5Score57 - 9 Shaheen Afridi to Shakeel Ahmed, Pitched up and on middle, Shakeel Ahmed clips it through mid-wicket for a single.23:15 (IST) Sep 120Overs13.4Score56 - 9 Shaheen Afridi to Shakeel Ahmed, Shaheen Afridi sees the batter back away and bowls this full and on off, angles in, Shakeel Ahmed throws his bat at it but hits it on the ground and misses. The ball just goes past the off pole.23:15 (IST) Sep 120Overs13.3Score56 - 9 Shaheen Afridi to Shakeel Ahmed, Slower one, good length and on middle, Shakeel Ahmed gets behind the line of it and blocks it out.23:14 (IST) Sep 120Overs13.2Score56 - 9 Shaheen Afridi to Shakeel Ahmed, Close! Back of a length and around off, takes off a bit and skids through as well, Shakeel Ahmed has a tentative push at it but gets beaten on the outside edge.23:14 (IST) Sep 120Overs13.1Score56 - 9 Shaheen Afridi to Shakeel Ahmed, Fuller in length, on middle, shaping in, Shakeel Ahmed fends it as the ball rolls away towards mid-wicket.23:13 (IST) Sep 12Score after 13 overs 56 - 9Runs Scored: 0 0(W)01(1WD)0004Samay Shrivastava 4 (5)Shakeel Ahmed 0 (7)Faheem Ashraf2-0-6-24Overs12.6Score56 - 9 Faheem Ashraf to Samay Shrivastava, FOUR! Oh..wow! A surprise boundary! Much fuller and on middle, Samay Shrivastava gets right underneath it and lofts it over mid on for four runs.23:12 (IST) Sep 120Overs12.5Score52 - 9 Faheem Ashraf to Samay Shrivastava, Beaten! Pulls his length back a bit, on the fifth stump line, shapes away, Samay Shrivastava looks to push it away but the ball zips past the outside edge.23:11 (IST) Sep 120Overs12.4Score52 - 9 Faheem Ashraf to Samay Shrivastava, Pitched up again, attacks the stumps, Samay Shrivastava pushes it back to the bowler again.23:11 (IST) Sep 120Overs12.3Score52 - 9 Faheem Ashraf to Samay Shrivastava, Goes fuller and on middle, Samay Shrivastava blocks it back to the bowler.23:10 (IST) Sep 121wdOvers12.3Score52 - 9 Faheem Ashraf to Samay Shrivastava, WIDE! Bangs in a slower bouncer, middle, but this spins way down the leg side, Samay Shrivastava lets it go. Wided.23:09 (IST) Sep 120Overs12.2Score51 - 9 Faheem Ashraf to Samay Shrivastava, Good-length delivery around off, holds its line, Samay Shrivastava leaves it alone.23:09 (IST) Sep 12Samay Shrivastava is the last man in for Oman.23:08 (IST) Sep 12WOvers12.1Score51 - 9 Faheem Ashraf to Hassnain Shah, OUT! CHOPPED ON! Faheem Ashraf hits the deck hard and bowls it around off stump. Hassnain Shah hangs back in the crease and looks to pull across the line. However, the ball isn't quite short enough and it goes off the inside edge to crash back onto the stumps. Hassnain departs for 1 (2) and Oman are now 51/9!23:07 (IST) Sep 12Score after 12 overs 51 - 8Runs Scored: 0 0(W)10000Shakeel Ahmed 0 (7)Hassnain Shah 1 (1)Shaheen Afridi3-0-19-10Overs11.6Score51 - 8 Shaheen Afridi to Shakeel Ahmed, Fuller and straighter, honing in on the stumps, Shakeel Ahmed pushes it out to mid off.23:06 (IST) Sep 120Overs11.5Score51 - 8 Shaheen Afridi to Shakeel Ahmed, Good change-up! Takes pace off and bowls it a tad full on off, Shakeel Ahmed is early into the drive and checks his shot but the ball beats the outside edge.23:05 (IST) Sep 120Overs11.4Score51 - 8 Shaheen Afridi to Shakeel Ahmed, Brings out a bouncer now, digging it in short and outside off. Shakeel backs away to uppercut but fails to get a bat on it.23:05 (IST) Sep 120Overs11.3Score51 - 8 Shaheen Afridi to Shakeel Ahmed, Full and on the fifth stump line, Shakeel Ahmed drives it firmly but straight to covers.23:04 (IST) Sep 121Overs11.2Score51 - 8 Shaheen Afridi to Hassnain Shah, A length ball from around the stumps, angled into the batter, Hassnain Shah clips it past square leg for a single.23:03 (IST) Sep 12Hassnain Shah is in next.23:03 (IST) Sep 12WOvers11.1Score50 - 8 Shaheen Afridi to Shah Faisal, OUT! BOWLED'EM! Shaheen Afridi gets into the wicket-taking act now and every Pakistan bowler, barring Abrar Ahmed has at least one wicket to his name. Good-length delivery, darted into the pads at around 137 kph. Shah Faisal backs away past the leg stump and gets cramped up and eventually, the ball flicks the pads and goes on to hit the stumps. The bails come off and down goes the 8th wicket for Oman. They are really going down in a hurry now.23:01 (IST) Sep 12Score after 11 overs 50 - 7Runs Scored: 0 100(W)000Shakeel Ahmed 0 (3)Shah Faisal 1 (2)Faheem Ashraf1-0-1-10Overs10.6Score50 - 7 Faheem Ashraf to Shakeel Ahmed, Back of a length and around off, fended away into the off side behind point.23:01 (IST) Sep 120Overs10.5Score50 - 7 Faheem Ashraf to Shakeel Ahmed, Oh, that's fallen in no man's land! Banged in short and around off Shakeel Ahmed wanders down the track and ends up spooning it in front of the point region, well short of the onrushing fielder.23:00 (IST) Sep 120Overs10.4Score50 - 7 Faheem Ashraf to Shakeel Ahmed, Short of a length and over off, Shakeel Ahmed has a late poke at it but gets beaen past the outside edge.22:59 (IST) Sep 12Shakeel Ahmed is in next.237 More UpdatesPakistan began their Asia Cup campaign with a dominant 93-run win over Oman in Dubai on Friday. Mohammad Haris’ fluent 66 off 43 balls laid the platform for Pakistan’s total of 160/7, but it was their bowlers who ensured a one-sided finish.Haris combined with Sahibzada Farhan in an 84-run second-wicket stand after the early loss of Saim Ayub for a golden duck. Haris struck seven fours and three sixes before falling to Aamir Kaleem, who alongside Shah Faisal claimed three wickets each to keep Pakistan’s scoring in check. Fakhar Zaman’s unbeaten 23 gave the innings late impetus.Oman’s chase never got going, undone by disciplined bowling and sharp fielding. Captain Jatinder Singh and Aamir Kaleem fell inside the powerplay, before Sufiyan Muqeem and Mohammad Nawaz struck in quick succession to leave Oman reeling. Shaheen Afridi’s direct hit to run out wicketkeeper Vinayak Shukla compounded the slide, and Mirza’s dismissal shortly after effectively sealed the result.Hammad Mirza offered brief resistance with 27 off 23 balls, but Oman folded for 67 in 16.4 overs. Muqeem, Ayub, and Faheem Ashraf picked two wickets each, while Afridi, Abrar Ahmed, and Nawaz chipped in with one apiece.The emphatic result gave Pakistan two vital points in Group A and momentum heading into their much-anticipated clash against India on Sunday. Oman, despite spirited efforts from Kaleem and Faisal with the ball, were left outclassed on their Asia Cup debut.Live Cricket Score | Asia Cup 2025Trending"
  },
  {
    "url": "https://timesofindia.indiatimes.com/toi-plus/health/mumbai-doctors-decade-long-study-reveals-why-sudden-deaths-are-rising-among-young-indians/articleshow/123307764.cms",
    "title": "Mumbai doctor’s decade-long study reveals why sudden deaths are rising among young Indians",
    "content": "Lata MishraTIMESOFINDIA.COMUpdated: Aug 15, 2025, 10:37 IST ISTDr Pradeep Vaideeswar, professor of cardiovascular and thoracic pathology at KEM Hospital, has closely examined sudden death cases involving young men and women for over a decade now. His two main findings – one, it is fat deposits, the kind not generally associated with the young, that are the main culprits; two, there is no link with Covid – not the infection, nor the vaccine"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/nano-banana-trend-15-easy-prompts-to-turn-photos-into-3d-figurines-with-google-ai-studio/articleshow/123863920.cms",
    "title": "Nano Banana trend: 15 easy prompts to turn photos into 3D figurines with Google AI Studio",
    "content": "Representative ImageGoogle's new AI image editor, \"Nano Banana,\" has made it easy for users to turn their photos into 3D models. The tool, officially known as Gemini 2.5 Flash Image, is integrated into the Gemini app, which has seen over 10 million downloads since the feature's launch. The \"Nano Banana\" tool has become popular for its speed and accuracy, allowing users to create 3D figurines, turn pets into designer toys, or make fantasy avatars with just a picture and a simple text prompt. According to Google, more than 200 million images have already been created or modified using the tool. Check out these 15 easy prompts and tips that can help users turn photos into 3D figurines with Google AI Studio using the Nano Banana tool:Nano Banana trend: 15 easy prompts to get 3D figurines from photosHere are some of the easy prompts that you can try to create 3D figurines from photos using the Google's Nano Banana tool:No.ConceptDescription1Realistic Figurine (1/7 Scale)Character in realistic style on a computer desk, round transparent acrylic base, with toy box featuring original artwork.2Plush ToyCute version with an oversized head, simple clothes, fuzzy fabric, a plain backdrop, and soft lighting.3Anime FigurineDynamic pose on a clear acrylic base, manga-inspired background, and neon lighting.4Superhero Action FigureDynamic stance, cape, with comic book–style packaging beside it.53D Video Game CharacterStanding on a platform in a pixelated environment, with video game props.6Photorealistic Animal FigurineSitting on a shelf, miniature accessories (food bowl, toys), and bright colours.7Astronaut CollectibleIn a spacesuit, on a moon base, a round stand, a galaxy backdrop.8Pop Star ModelPerforming on a mini stage, with a microphone, concert lighting, and music-note decorations.9Fantasy Character ToyHolding a sword or staff, in a magical forest scene with glow effects.10Businessperson FigurineSuit and tie, holding a laptop, with stacked books nearby.11Hologram ModelTransparent lines, sci-fi aesthetic, displayed on a tech table.12Sports Star CollectableJersey uniform, celebration pose, mini stadium, trophy accessory.13Cartoon-Style FigurinePlayful colours, oversized shoes, comic props.14Pet Designer CollectableWearing a bandana or collar, playful stance, on a pet bed background.15Historic Figure ModelPeriod attire, an old map backdrop, and a stand labelled “Limited Edition”.PollHave you tried using Google's Nano Banana tool for creating 3D models from photos?Yes, I love it!No, but I'm interested.Elon Musk’s Starlink To Begin Trials in India"
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/cricket/news/prominent-figure-in-cricket-under-investigation-for-drink-spiking-sexual-assault/articleshow/123864832.cms",
    "title": "Prominent figure in cricket under investigation for drink spiking, sexual assault",
    "content": "Representational photoA prominent English cricket figure in his 40s is under Scotland Yard investigation for alleged drink spiking and sexual assault of two women at a pub in south-west London's SW6 district in May. The case comes amid increasing pressure on cricket authorities to address misconduct in the sport.The Metropolitan Police confirmed they are investigating the incident that occurred on May 22 in the Fulham and Parsons Green area. The man was interviewed under caution in June, though no arrests have been made.\"We are currently investigating allegations of spiking and sexual assault against two women that took place on Thursday, 22 May at a pub in the SW6 area,\" stated the Metropolitan Police.\"Two women are believed to have been spiked with one also allegedly sexually assaulted. A man in his 40s was interviewed under caution on Thursday, 5 June. Enquiries remain ongoing and no arrests have been made at this stage.\"The England and Wales Cricket Board (ECB) has not yet commented on the matter.Chris Haward, managing director of the Cricket Regulator, the independent body handling disciplinary cases, emphasised last month: \"Removing sexual misconduct from the game is a priority.\"The Cricket Regulator has taken action against two coaches in separate incidents over the past year. One coach received a nine-month suspension in August for sending inappropriate photos to junior female staff members.Another coach was suspended for six months last November for inappropriate sexual behavior during a county pre-season tour."
  },
  {
    "url": "https://timesofindia.indiatimes.com/education/how-isb-onlines-product-management-programme-is-helping-modern-managers-integrate-ai-and-genai-into-work-routines/articleshow/123847074.cms",
    "title": "How ISB Online’s Product Management Programme is helping modern managers integrate AI and GenAI into work routines",
    "content": "Artificial Intelligence is no longer a trend, it’s part of everyday life, from voice assistants to facial recognition. In product management, AI powers innovation, seamless user experiences, and rapid data analysis. It helps product managers overcome challenges in market research, inefficiencies, and prototyping delays. According to McKinsey report1, Generative AI accelerated product time to market by 5 percent, thus improving product managers' productivity by 40 percent, and uplifted employee experience by 100 percent. Therefore, product managers should be equipped with AI and the revolution it is heralding.Aspiring product managers or even established ones, should explore a programme that combines product management skills with a deep understanding of AI and GenAI. ISB Online’s Product Management Programme has been designed to bridge the skills gap in AI-powered product development, as it equips candidates with a holistic toolkit for navigating and excelling in today’s technology-driven world.What makes ISB Online’s Product Management Programme outstanding?The programme stands out for the following reasons:AI-Powered product management: Candidates will have the opportunity to explore Generative AI models and architecture like GANs, Generative AI for market research and product roadmaps, productivity, data analytics, customer engagement, user experience, applications, use cases and ethical considerations.Expert-led live masterclasses: The seven masterclasses offer insights from top product managers at leading Indian startups such as Flipkart, Swiggy, and Paytm.Access to essential PM toolkit: Master industry-leading product management tools, including AI-powered analytics platforms and agile development software. Candidates will work with tools like Asana, Figma, SQL, etc. to develop efficient, high-quality products.Hands-on projects: Candidates can tackle real-world challenges by creating product roadmaps, enhancing analytics, and turning user research into actionable product designs.Networking opportunities: The ISB Online Network will help candidates connect with experienced professionals, share insights, and build relationships with like-minded peers and industry experts.In-depth case studies: Detailed case studies from companies like Airbnb, Monday.com, LinkedIn, Tinder, etc. are provided to help candidates understand their product management strategies.What are the outcomes of ISB Online’s Product Management Programme?With the completion of this programme, candidates will develop a sharp product mindset, which is needed to bring operational products (or services) to marketCandidates will be able to use AI to define the problem, find solutions, map the customer journey, and articulate user personasCandidates will analyse AI strategies and frameworks for developing, marketing, and selling a productCandidates will evaluate product road mapping and prototyping decisions using various product management techniques and practicesCandidates will outline a plan to create a competitive scalable product using key product development strategies and frameworksWhat are the advantages of the ISB Online Network?Candidates will get access to newsletters with the latest updatesThey can take advantage of networking opportunities via the helpful ISB Online Network Group on LinkedInCandidates will get exclusive invitations to online and offline events like webinars, conferences, and masterclasses, amongst othersCandidates will be able to upgrade to ISB Online Alumni status by completing 100+ learning hoursWho is the programme for?Individuals who are looking to change their existing field to that of Product Management, and are looking to strengthen their foundations so that they start strong in this careerMid and senior-level managers who want to manage new and mature products using AI, from conception to execution and measure performance to drive profitabilityBusiness heads and entrepreneurs who want to spearhead the usage of product strategies in their organisation and drive product-focused decision-making and planningWhat are the programme details?Eligibility: Any Graduate/Diploma HolderDuration: 16 Weeks | 4-6 Hours a WeekProgramme starts on: September 30, 2025Programme fees*: INR 1,59,900 + GST (currently @ 18%) will be charged extra on these components. Instalment payment options are available. For detailed information on instalment payments and other details, check the programme page. References - https://www.mckinsey.com/industries/technology-media-and-telecommunications/our-insights/how-generative-ai-could-accelerate-software-product-time-to-market Disclaimer: This article has been produced on behalf of Emeritus by Times Internet’s Spotlight team."
  },
  {
    "url": "https://timesofindia.indiatimes.com/education/are-you-ai-ready-growing-skills-gap-demands-a-reality-check/articleshow/123848973.cms",
    "title": "Are you AI ready? Growing skills gap demands a reality check",
    "content": "The National AI Olympiad benchmarks AI readiness, helping school students, college students and professionals discover where they stand in their AI journey. ​​It creates space for every learner, regardless of age or background, to begin or advance their AI readiness path.Not long ago, the internet defined how we searched, learned, and worked. School projects meant browsing endless links, while college assignments pushed students to dig deeper into digital sources. Now, in the age of intelligence, AI is transforming this journey, helping professionals analyse data, automate routine tasks, and make faster, sharper decisions. Beyond workplaces too, it’s embedded in daily life, from shopping recommendations and real-time translations to wearables that track our health. AI is no longer a distant idea; it’s quietly shaping the choices and opportunities for students, professionals, parents, and retirees alike.Yet, despite this growing presence, many people still struggle to understand what AI really is and how it works. As India steps beyond the digital age, the question is no longer if AI will impact our lives, but how prepared are we to navigate this new age of intelligence?AI’s rapid rise and the challenges it bringsArtificial Intelligence is advancing much faster than our education systems and workplaces can keep pace with. On the surface, this signals promise. But a closer look reveals an imbalance: only one in five young adults in the country has actually participated in any formal AI-related training.This gap is starkly felt in the workplace. A study by Amazon Web Services found that while 96% of employers in India prioritise hiring AI-skilled talent, nearly 79% struggle to find qualified candidates1. In higher education, many graduates step out “degree-ready” but not truly “AI-ready,” leaving them underprepared for real-world opportunities. In fact, within our education system, enthusiasm for AI tools is already visible, yet without structured guidance, students risk mistaking usage for understanding2. These challenges underscore a single reality: India cannot afford to leave AI readiness to chance. What is needed is a structured, accessible way to introduce students, teachers, and professionals alike to AI literacy. That is where initiatives like the National AI Olympiad (NAIO) play a transformative role, building awareness, confidence, and competence at the grassroots level.How the National AI Olympiad maps India’s AI readinessFor decades, Olympiads in mathematics and science have pushed learners to go beyond textbooks, test their abilities on a national stage, and earn recognition. With AI now reshaping education and work, a similar platform has become essential. The National AI Olympiad (NAIO), is a one-of-its-kind initiative by TalentSprint, part of Accenture that aims to democratise access to AI awareness and readiness. The Olympiad begins with an online 90-minute exam with multiple choice questions, followed by a project phase for top performers under guidance and mentorship by industry experts. To support preparation, participants can opt for a Prep Kit that includes study material, sample papers, and topic guides aligned with their category.The Olympiad is divided into three categories, each tailored to a different stage of learning and growth:Foundation (Grades 6–8 and 9–12): Designed to spark curiosity and build understanding of core AI concepts. Focus areas include applied AI reasoning, coding, and essential AI skills.Advanced (College and University students): Helps learners across all streams test their preparedness for higher studies and AI-driven careers, with emphasis on reasoning, code reading, and application-based problem-solving.Professional (Working professionals): Enables professionals across industries to benchmark AI readiness, identify skill gaps, and apply AI knowledge to workplace challenges.How the Olympiad works, and what is in it for the participantsThe National AI Olympiad is a sequence of events. Here are some important dates and milestones to take note of.21st September 2025: Deadline to register for your respective category. On registration, you get instant access to sample papers and the platform to prepare well for the Olympiad. Those who have opted for Prep-Kit will get access to additional course content for the category they opted for.27–28 September 2025 [Stage 1]: Participate in a 90-minute online assessment with 50 multiple-choice questions, where participants assess their AI readiness at regional and national levels.October 2025: Announcement of Olympiad results. Participants receive their certificate of participation along with a detailed assessment report. Regional and National winners across respective categories will receive merit certificates.Nov-Dec 2025 [Stage 2]: Top rankers in each category will get to work on a hands-on project with expert mentorship from TalentSprint and the opportunity to showcase their work to leading institutes and corporates.Jan 2025: National winners of Stage 2 in each category will be awarded various prizes.As AI is no longer limited to tech circles, its application is becoming a life skill, and a language of the future. The National AI Olympiad has been structured so that every learner, regardless of age or background, can find their place in this journey. Building AI readiness across students and professionals alike ensures not just individual growth but a collective ability to adapt to rapid change. In preparing for this future, learners at every stage gain the opportunity to stay relevant, resilient, and ready for the challenges of a technology-driven world.References:https://press.aboutamazon.com/in/2024/3/ai-skills-could-boost-salaries-of-workers-in-india-by-more-than-54-and-accelerate-career-growth-as-ai-adoption-ramps-up-finds-new-researchhttps://timesofindia.indiatimes.com/education/news/only-1-in-5-indian-youth-is-ai-skilled-latest-report-flags-massive-opportunity-gap/articleshow/122297737.cmsDisclaimer: The article has been produced on behalf of Talentsprint by the Times Internet's Spotlight team."
  },
  {
    "url": "https://timesofindia.indiatimes.com/business/infrastructure/mizorams-first-railway-line-pm-modi-inaugurates-rs-8070-crore-worth-bairabisairang-project-rajdhani-flagged-off-to-link-aizawl-with-national-network/articleshow/123864448.cms",
    "title": "Mizoram's first railway line: PM Modi inaugurates Rs 8,070 crore worth Bairabi–Sairang project; Rajdhani flagged off to link Aizawl with national network",
    "content": "PM Modi inaugurates Rs 8,070 crore worth Bairabi–Sairang project (Picture credit: ANI)Prime Minister Narendra Modi on Saturday inaugurated Mizoram’s first-ever railway line, the Bairabi–Sairang broad-gauge project, marking a historic moment in the state’s connectivity journey. Built at a cost of Rs 8,070 crore, the 51.38-km line is being regarded as one of the most complex undertakings in Indian Railways’ history.PM Modi Says BJP Reversed Congress Neglect As Mizoram Emerges Key To India’s Act East PolicyHow a 15-year vision turned into realitySanctioned in 2008-09 and launched for construction in 2015, the line features 45 tunnels, 55 major bridges, 87 minor bridges and ten road over- and underpasses. Nearly 54% of the alignment passes through tunnels and bridges. Among its most striking structures is Bridge No. 144 near Sairang, which at 114 metres stands taller than Delhi’s Qutub Minar, making it the tallest pier railway bridge in the country, according to the Northeast Frontier Railway. The project also added four stations — Hortoki, Kawnpui, Mualkhang and Sairang — connecting communities along the route.Why Aizawl’s first rail link is a game-changerThe new route extends connectivity from Bairabi on the Assam–Mizoram border to Sairang, just 20 km from Aizawl, directly linking the state capital with India’s railway network for the first time. With this, Aizawl becomes the fourth northeastern capital to gain direct rail access, after Assam's Guwahati, Tripura's Agartala and Arunachal Pradesh's Itanagar.From Aizawl to Delhi: the new rail routes unveiledThe Prime Minister also flagged off three new long-distance services: the Sairang–Delhi Rajdhani Express, the Sairang–Guwahati Express, and the Sairang–Kolkata Express. According to Indian Railways, the inaugural Rajdhani left Sairang at 10 am on Saturday to reach Anand Vihar Terminal on September 15. Regular services will see the train depart Sairang every Friday evening and return from Delhi every Sunday night. The Guwahati Express will run daily from September 13, departing Guwahati at 7 pm and Sairang at 7 pm the next day. The Kolkata Express will operate thrice weekly, leaving Kolkata every Saturday, Tuesday and Wednesday and returning from Sairang every Monday, Thursday and Friday.Building railways through rocks, rivers and ridgesThe Prime Minister’s Office said the line would provide “safe, efficient and cost-effective travel options,” while ensuring timely supplies of essentials like food grains and fertilisers, as per news agency PTI. Railway minister Ashwini Vaishnaw underlined that the project had to overcome “Himalayan geology and complex terrain,” noting that engineers even had to solidify loose sand into rock formations before tunnelling could proceed.What else PM Modi announced beyond the railway lineAlongside the rail project, the Prime Minister laid foundation stones for a range of infrastructure works worth over Rs 9,000 crore. These include the 45-km Aizawl Bypass Road under PM-DevINE, the Thenzawl–Sialsuk Road and the Khankawn–Rongura Road under NESIDS, aimed at easing travel and improving access for farmers and traders. The Thenzawl–Sialsuk Road is expected to benefit horticulture farmers, dragon fruit growers, paddy cultivators and ginger processors, while the Khankawn–Rongura Road will support market access and a planned ginger processing plant (PTI). The Prime Minister also launched projects such as the Chhimtuipui bridge, which will provide all-weather connectivity and support cross-border commerce under the Kaladan Multimodal Transit framework. Other projects include an LPG bottling plant at Mualkhang, new sports infrastructure, and residential schools under PMJVK and the Eklavya Model scheme.How Mizoram’s new rail line will change daily lifeOfficials said the Bairabi–Sairang railway is expected to transform logistics and tourism, reduce travel time and generate employment. “This project has been constructed under great challenges,” Vaishnaw said, adding that it was a major step in implementing the government’s Act East Policy."
  },
  {
    "url": "https://timesofindia.indiatimes.com/world/middle-east/no-occupation-india-backs-un-resolution-votes-for-sovereign-palestinian-state-along-with-142-nations/articleshow/123862727.cms",
    "title": "'No occupation': India backs UN resolution; votes for 'sovereign Palestinian state' along with 142 nations",
    "content": "Pro-Palestine demonstrators march on August 24, 2025 in Melbourne, Australia.India on Friday backed a resolution in the UN General Assembly supporting the 'New York Declaration' on resolving the Palestine issue through peaceful means and advancing the two-state solution.The resolution, introduced by France, was adopted with 142 votes in favour, 10 against, and 12 abstentions. The US, Israel, Argentina and Hungary were among the countries that opposed it.Big Win For Palestine: 142 Countries Including India Vote In Favour Of Palestinian StatehoodThe text, formally titled 'Endorsement of the New York Declaration on the Peaceful Settlement of the Question of Palestine and the Implementation of the Two-State Solution', had been circulated at a high-level international conference in July at the UN headquarters, co-chaired by France and Saudi Arabia.PollDo you think the two-state solution can bring lasting peace to the region?Yes, it canNo, challenges remainAccording to the declaration, leaders \"agreed to take collective action to end the war in Gaza, to achieve a just, peaceful and lasting settlement of the Israeli-Palestinian conflict based on the effective implementation of the two-state solution, and to build a better future for Palestinians, Israelis and all peoples of the region.\"It called on Israel’s leadership to issue a clear public commitment to the two-state solution, including recognition of a sovereign and viable Palestinian state. It also urged Israel to \"immediately end violence and incitement against Palestinians, to immediately halt all settlement, land grabs and annexation activities in the Occupied Palestinian Territory, including East Jerusalem, publicly renounce any annexation project or settlement policy, and put an end to settlers’ violence.\"The declaration reaffirmed \"support for the right of the Palestinian people to self-determination.\"\"Recent developments have highlighted, once again, and more than ever, the terrifying human toll and the grave implications for regional and international peace and security of the persistence of the Middle East conflict,\" it said.\"Absent decisive measures towards the two-state solution and robust international guarantees, the conflict will deepen and regional peace will remain elusive,\" it added.Stressing that \"the war in Gaza must end now,\" the declaration noted that \"Gaza is an integral part of a Palestinian State and must be unified with the West Bank. There must be no occupation, siege, territorial reduction, or forced displacement.\""
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/we-dont-need-these-ai-tutors-elon-musks-xai-says-in-internal-memo-to-employees-as-it-asks-500-grok-trainers-to-exit/articleshow/123863369.cms",
    "title": "We don’t need these AI tutors: Elon Musk’s xAI says in internal memo to employees as it asks 500 Grok trainers to exit",
    "content": "Elon Musk's artificial intelligence (AI) startup, xAI, has laid off at least 500 workers on its data annotation team, a report claims. The company’s employees were reportedly notified via email that the company was downsizing its team of generalist AI tutors. The report cited internal messages to claim that the laid-off workers were told they would be paid through either the end of their contract or November 30. Their access to company systems was terminated the day they received the notice, the report notes. What xAI said about laying off Grok trainersAccording to a report by Business Insider, the internal email sent to xAI employees about the latest job cuts read: “After a thorough review of our Human Data efforts, we've decided to accelerate the expansion and prioritisation of our specialist AI tutors, while scaling back our focus on general AI tutor roles. This strategic pivot will take effect immediately. As part of this shift in focus, we no longer need most generalist AI tutor positions and your employment with xAI will conclude.”The layoffs come after xAI recently announced on social media platform X that it was hiring and planned to grow its team of specialist AI tutors by \"10X.\"In the X post, xAI wrote: “Specialist AI tutors at xAI are adding huge value. We will immediately surge our Specialist AI tutor team by 10x! We are hiring across domains like STEM, finance, medicine, safety, and many more. Come join us to help build truth-seeking AGI!”xAI’s data annotation team, which is the company’s largest unit, is responsible for training Grok by categorising and contextualising raw data. Before the layoffs, the main Slack channel for data annotators had over 1,500 members. However, screenshots from later that evening showed the number had dropped to just over 1,000 and continued to fall during the reporting period, the report added.Layoff notices followed shortly after several senior employees, including the former head of the team, had their Slack accounts deactivated earlier in the week, the report highlighted.In the days that followed, workers said they were called into one-on-one meetings to review their responsibilities and projects, and were asked to highlight colleagues they felt deserved recognition.Earlier this week, xAI told staff to prepare for a reorganisation of the team. In a company-wide message, workers were instructed to prioritise a series of tests due by the next morning, which would help determine their future roles.Screenshots viewed by Business Insider revealed that the tests aimed to categorise annotators and supervisors by their strengths and interests.The notice was posted by Diego Pasini, whom ten workers identified as the new leader of the team. Pasini, who joined xAI in January and is currently on leave from his undergraduate studies at the Wharton School, asked staff to complete at least one test by the next morning.The tests covered fields such as STEM, coding, finance, and medicine, as well as areas like Grok’s “personality and model behaviour” and “shitposters and doomscrollers.” Additional tests focused on chatbot safety, red-teaming, and handling audio and video content.The announcement noted that the tests targeted supervisors and generalist tutors. xAI’s teams are divided into specialities such as STEM, coding, finance, legal, and media, along with generalist tutors who take on a broad range of assignments. Workers said some of the assessments were conducted on CodeSignal, while others were hosted on Google Forms.As per to the screenshots, more than 200 workers responded to Pasini’s post with a green check-mark emoji, while over 100 left comments and questions. Elon Musk’s Starlink To Begin Trials in India"
  },
  {
    "url": "https://timesofindia.indiatimes.com/astrology/horoscope/daily-lal-kitab-horoscope-today-september-13-2025-mars-in-libra-to-bring-sudden-wealth-for-these-zodiac-signs/articleshow/123801054.cms",
    "title": "Daily Lal Kitab Horoscope Today, September 13, 2025: Mars in Libra to Bring Sudden Wealth for These Zodiac Signs",
    "content": "This daily horoscope series blends Lal Kitab’s astrological wisdom with personalised guidance for each zodiac sign. It focuses on planetary influences, karmic patterns, and simple, symbolic remedies. With grounded language and cultural depth, each entry helps you align your energy, thoughts, and actions for emotional and spiritual balance.Aries Lal Kitab Horoscope Today, 13 September 2025 Moon and Rahu may bring sudden shifts, while Mars fills you with restlessness. Today you may feel a momentary loss, like dropping your hat in the wind, yet Saturn reminds you that what slips away often clears space for something better. Ketu helps you detach from small disappointments and focus on what stays. By evening, a sense of balance returns. Choose calm over chasing fleeting moments. Lal Kitab Remedy: Offer water to a peepal tree in the morning without touching it directly.Taurus Lal Kitab Horoscope Today, 13 September 2025 Moon under Saturn’s watch makes you thoughtful, while Mars urges action. Something unexpected, like spotting graffiti with a hidden message, may remind you of signs that guide your path. Rahu can confuse your priorities, but Ketu supports simple choices. Today is about noticing meaning in small details. By evening, your patience will bring peace and clarity. Trust your inner sense rather than outside noise. Lal Kitab Remedy: Keep a few white flowers at home in a clean bowl of water for positivity.Gemini Lal Kitab Horoscope Today, 13 September 2025 Moon with Ketu may create distractions, while Mars makes you quick and impulsive. An unexpected moment, like walking into a glass door, may teach you awareness. Saturn advises slowing down and paying attention, while Rahu warns against rushing. Take pauses before decisions and do not let embarrassment unsettle you. Evening brings relief if you embrace patience and humor. Today is for learning presence in every step. Lal Kitab Remedy: Keep a little honey in a small glass jar in your kitchen for harmony.Cancer Lal Kitab Horoscope Today, 13 September 2025 Moon influenced by Saturn may bring emotional sensitivity, while Mars makes you act with urgency. A small realization, like discovering a crack on your phone cover, may remind you that not everything lasts forever. Rahu may cause worry, but Ketu shows acceptance is strength. Focus on care rather than perfection. Evening offers comfort when you release stress and enjoy simple peace. Lal Kitab Remedy: Feed-soaked rice to birds early in the morning with a calm and kind thought.Leo Lal Kitab Horoscope Today, 13 September 2025 Moon and Rahu may stir sudden emotions, while Mars brings energy that can feel restless. You may face an unexpected moment, like someone sneezing right behind you, making you alert about surroundings. Saturn reminds you to keep patience and not overreact. Ketu guides you to detach from irritation and focus on your own rhythm. Evening will calm you if you slow down and accept what is beyond control. Lal Kitab Remedy: Keep a piece of red cloth in your wallet to attract positivity and confidence.Virgo Lal Kitab Horoscope Today, 13 September 2025 Moon under Saturn’s influence may bring a sense of duty, while Rahu makes your mind wander. You might feel uneasy, like hearing a song you dislike on repeat, but Mars gives you strength to stay focused. Ketu encourages detachment from things that annoy you. By evening, your mood will shift if you avoid overthinking. Stay calm and let the day pass without giving too much power to irritation. Lal Kitab Remedy: Offer green fodder or spinach to a cow today with a pure intention.Libra Lal Kitab Horoscope Today, 13 September 2025 Moon with Ketu deepens awareness, while Saturn may make you notice small imperfections. You might find a loose thread on your sleeve, reminding you that even small details matter. Mars energizes you to act, but Rahu warns against pulling too hard at things without thought. Balance is key today. Evening will bring peace if you handle situations gently and without hurry. Value subtle reminders of care and patience. Lal Kitab Remedy: Keep a few basil leaves in a glass of clean water at home for freshness.Scorpio Lal Kitab Horoscope Today, 13 September 2025 Moon and Saturn may test your patience, while Mars gives energy to face unexpected moments. You may experience kindness, like a stranger offering you tissues, showing that support can arrive from anywhere. Rahu may tempt you to doubt others, but Ketu encourages gratitude. Accept help without hesitation. By evening, you will feel lighter if you focus on trust and openness. This day teaches value in small gestures. Lal Kitab Remedy: Offer a little milk to flowing water early in the morning for peace of mind.Sagittarius Lal Kitab Horoscope Today, 13 September 2025 Moon with Saturn may slow your pace, while Mars adds a push to act quickly. A small encounter, like bumping into someone and apologizing, will remind you of humility. Rahu may bring restlessness, but Ketu encourages you to learn from such moments. Today is about balance between energy and patience. Evening will bring a sense of relief when you accept mistakes as part of growth. Lal Kitab Remedy: Offer a small piece of bread with ghee to a cow for blessings and calmness.Capricorn Lal Kitab Horoscope Today, 13 September 2025 Moon and Rahu may create forgetfulness, while Saturn reminds you of responsibility. You might feel frustrated, like leaving your grocery list at home, yet Mars helps you manage with improvisation. Ketu guides you to not hold onto small mistakes. This day asks you to focus on adaptability instead of regret. Evening brings peace if you laugh off minor lapses and keep your spirit light. Lal Kitab Remedy: Place a little rice in a white cloth and keep it quietly in your cupboard.Aquarius Lal Kitab Horoscope Today, 13 September 2025 Moon under Saturn’s gaze may make you sensitive, while Rahu stirs sudden distractions. An unexpected loudspeaker announcement may startle you, but Mars gives courage to respond quickly. Ketu advises you not to hold onto the shock for long. Accept sudden changes as part of life’s rhythm. Evening settles with clarity if you keep patience and listen carefully before acting. Lal Kitab Remedy: Keep a copper coin in your pocket to balance emotions and sharpen awareness.Pisces Lal Kitab Horoscope Today, 13 September 2025 Moon and Saturn may test your patience, while Mars pushes you to act quickly. You may face a small irritation, like finding your pen leaking ink in your pocket, yet Rahu teaches awareness of carelessness. Ketu helps you detach from the frustration and focus on solutions. Evening will feel calmer when you take things lightly and laugh at small troubles. Lal Kitab Remedy: Offer clean water mixed with a few tulsi leaves at your home altar in the morning."
  },
  {
    "url": "https://timesofindia.indiatimes.com/world/us/from-bella-ciao-to-notices-bulges-owo-whats-this-meaning-of-charlie-kirk-shooter-tyler-robinsons-cryptic-messages/articleshow/123857100.cms",
    "title": "From 'Bella ciao' to 'notices bulges OwO what's this': Meaning of Charlie Kirk shooter Tyler Robinson's cryptic messages",
    "content": "22-year-old Tyler Robinson, suspect in Charlie Kirk assassination, left cryptic messages on bullet casings. Charlie Kirk's suspected shooter Tyler Robinson left several messages engraved on the bullet casings, shedding light into the 22-year-old's mind who was becoming political and intolerant of Charlie Kirk's ideologies. The messages range from anti-fascism messages to meme references. Three unfired casings found in the chamber of the rifle reportedly used by Robinson included left-wing slogans such as “Hey fascist! Catch!” engraved on the side along with an up arrow, a right arrow and three down arrows.FBI Releases Video Footage Of Charlie Kirk’s Killer; Trump Demands Death PenaltyAnother featured the words “Oh bella ciao, bella ciao, bella ciao ciao ciao,” referencing to the popular anti-fascist song. “If you read this, you are gay LMAO [laugh my a** off]” was written on the third. “Notices, bulges, OwO, what’s this?” was written on the fired casing.“↑ → ↓ ↓ ↓” refers to a stratagem input from the game Helldivers 2 to summon an Eagle 500kg Bomb. This is unrelated to Antifa groups which use a three arrow symbol (three diagonal down arrows), with no reference to \"↑ →\" arrows.'notices, bulges, OwO' is associated with furry and roleplay communities. It's used to describe awkward or over-the-top online flirting.PollDo you think social media trends influence people’s behavior?Yes, a lotNo, not reallyBella Ciao is an Italian protest folk song which became an anthem of the Italian anti-fascist resistance during World War II, sung by partisans fighting against Mussolini’s regime and Nazi occupation. The literal meaning of the phrase is: 'Goodbye, beautiful'. But now it's globally popular phrase symbolizing rebellion.Tyler Robinson's familyRobinson's parents are Amber Jones Robinson and Matt Robinson, longtime residents of Washington, Utah, in the southwest-most corner of the state. The family owns a six-bedroom home in the suburbs, valued at around $634,400, according to Zillow. Tyler confessed to his father and priest that he killed Kirk. He initially threatened that he would rather kill himself but wouldn't surrender. His parents convinced him and his father escorted him back to Orem to turn him in to the appropriate authroities. Tyler’s father, Matt Robinson, has served with the Washington County Sheriff’s department for 27 years and was the one who contacted authorities and ensured his son’s surrender before an arrest. Robinson also has two brothers, according to a 2021 Facebook post by his mother, Amber, marking the start of a new school year.Robinson did not attend UVU, and may have only attended Utah State University for one semester in 2021, according to a statement from the school. In a statement posted on the school's website: \"Utah State University confirms that Tyler Robinson, the suspect arrested in the killing of Charlie Kirk, briefly attended Utah State University for one semester in 2021.\""
  },
  {
    "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/karishma-sharma-gives-health-update-reveals-why-she-jumped-from-a-moving-train-my-friend-is-from-kolkata/articleshow/123865964.cms",
    "title": "Karishma Sharma gives health update; reveals why she 'jumped' from a moving train: ‘My friend is from Kolkata…’",
    "content": "Karishma Sharma, known for her roles in 'Pyaar Ka Punchnama 2' and 'Ragini MMS Returns,' recently faced a terrifying incident while travelling on a local train in Mumbai. On Wednesday, she sustained multiple injuries after she ‘jumped’ out of a moving train.Karishma, who has now been discharged and is recovering at home, told Hindustan Times, “I have suffered multiple injuries, and I have a disturbing memory lapse. I have been experiencing physical pain, but for now I’m home. My mother has come to Mumbai to help me in my recovery.”Ragini MMS Karishma Sharma injured after jumping off moving train — 'My head is swollen'She expressed fear of travelling by trainReflecting on the incident, Karishma shared how scared she feels now. \"I don’t think I can go anywhere near a train station or travel by it anytime soon. The whole incident has traumatized me and left me scared for now. Such a happy memory has been tarnished for me.”Sharma continues to struggle with ongoing painTalking about her health, the 31-year-old said, “My head feels heavy. There’s still a lot of pain. The doctors discharged me, as my MRI didn’t show any internal injury, but they warned me to stay alert and cautious. If it hurts after a day or two, I’ll have to rush back to the hospital because it takes some time for the internal injuries to get detected.”She also revealed that some of her injuries only became apparent later. She said that she had small water-filled bubbles around her ankles, which felt like water balloons, and her leg was burning. Her head felt very heavy, making it difficult to keep it straight, and keeping it down was causing additional pain in her neck.She faced memory loss and confusion after the accidentKarishma recalled losing her memory for nearly two hours, feeling disoriented and confused. “My hands were shivering. I wasn’t able to figure out what was happening. I still can’t pinpoint and tell what really made me do what I did.” The most frightening part, she says, is not remembering how she fell from the train.Why did she jump?Clarifying that it was not deliberate, she explained, “My friend is from Kolkata, so she didn’t know about trains, and the hairdresser who was travelling with us is from Bombay. I didn’t realize that there was another train that we could’ve taken; I mean, I used to travel by train as a kid between Patna and Bombay, and travelling by trains always brings back happy memories, but I don’t know what triggered me; I just jumped, and I have zero memory of it.” She added that a lady constable and another woman rescued her and took her to a small clinic at the station, and she asked to be taken to a hospital in Andheri instead of a government hospital."
  },
  {
    "url": "https://timesofindia.indiatimes.com/entertainment/hindi/bollywood/news/8-10-rounds-were-fired-disha-patanis-father-jagdish-patani-reacts-on-bareilly-home-attack-confirms-gunshots-were-foreign-made/articleshow/123865718.cms",
    "title": "'8-10 rounds were fired': Disha Patani’s father Jagdish Patani REACTS on Bareilly home attack; confirms gunshots were 'foreign-made'",
    "content": "Disha Patani, known for films like 'M.S. Dhoni: The Untold Story', 'Malang', and 'Baaghi 2', faced a frightening incident when gunshots were fired at her family home in Bareilly. Her father, Jagdish Patani, a retired police officer, has now confirmed that foreign-made weapons were used and described the terrifying attack on their residence.Shots fired at Disha Patani’s residenceJagdish Patani told ANI, \"Two unidentified assailants fired at my residence. Police are making all possible efforts...Bareilly Police, SSP, and ADG are all working on it.Firing Outside Disha Patani’s Home! Goldy Brar Gang’s Deadly Threat to BollywoodHe further added, “The gunshots are not indigenous; they are foreign-made. I think 8-10 rounds were fired. I came to know through social media that Goldy Brar has taken its responsibility, but it is not clear yet.\"Two motorbike assailants targeted the homeAs reported by ANI, according to police, two people on a motorcycle fired at the Patani home around 3:30 am. SSP Bareilly, Anurag Arya, said, \"We received information about the firing at retired CO Jagdish Patani's residence by two unidentified motorbike-borne assailants. Police teams were immediately sent to the site. An FIR has been registered at the Kotwali police station under various sections. Armed police personnel have been deployed for the protection of the family members.\"He added, \"We will take strict action against the involved accused. I personally met with the family and have assured them of their safety.\"Goldy Brar group claimed responsibility publiclyAs per the reports, the Goldy Brar group has claimed responsibility for the attack. A gang member, Veerendra Charan, wrote on Facebook, \"I am Veerendra Charan, Mahendra Saran (Delana). Brothers, today, the firing that took place at the house of Disha Patani (Bollywood actress) has been done by us. She had insulted our revered saints (Premanand Ji Maharaj and Aniruddh Acharya Ji Maharaj) and tried to belittle our Sanatan Dharma.\"He added, \"The insult to our deities will not be tolerated. This was just a trailer. If she or anyone else shows disrespect towards our religion again, not a single person in their house will be left alive. This message is not just for her, but for all the film industry artists and those associated with them.\"Police teams investigate the shooting furtherPolice have formed five teams under SP City and SP Crime to investigate the shooting further. They are also keeping a close watch on the Patani family and have increased security measures at their residence. More details about the case and the accused are awaited as the authorities are monitoring the situation."
  },
  {
    "url": "https://timesofindia.indiatimes.com/web-series/news/hindi/from-coolie-to-the-girlfriend-ott-series-and-movies-to-enjoy-over-the-weekend/photostory/123859155.cms",
    "title": "From ‘Coolie’ to ‘The Girlfriend’: OTT series and movies to enjoy over the weekend",
    "content": "Newsweb-serieshindiFrom ‘Coolie’ to ‘The Girlfriend’: OTT series and movies to enjoy over the weekendTrendingETimes.in /  Sep 13, 2025, 12:24 ISTAAText SizeSmallMediumLarge1/6​From ‘Coolie’ to ‘The Girlfriend’: OTT series and movies to enjoy over the weekendThis weekend brings a vibrant mix of OTT releases across genres—action thrillers, heartfelt romances, psychological dramas, and gripping mysteries. Expect powerful performances, engaging stories, and fresh themes that promise to keep you hooked from start to finish. From emotional journeys to suspense-filled plots and lighthearted moments, the lineup has something for everyone. Here’s a look at the releases that will brighten up your weekend watchlist.2/6​‘Coolie’This Tamil action drama stars Rajinikanth as Deva, a former union leader who, while investigating the death of his estranged friend, finds himself entangled in the dangerous world of gold and heart smuggling. Directed by Lokesh Kanagaraj, the film also features Soubin Shahir, Nagarjuna Akkineni, and Shruti Haasan in pivotal roles. The movie is streaming on Amazon Prime Video.3/6​‘You and Everything Else’This slice-of-life K-drama follows the deep bond between two women, played by Kim Go Eun and Park Ji Hyun, as they grow from youth to adulthood. Their journey through love, heartbreak, and loss makes the story both heartfelt and relatable. The drama is streaming on Netflix.4/6​‘Only Murders in the Building’ season 5The fan-favourite murder mystery series returns with another thrilling season, once again following Mabel, Charles, and Oliver. Season 4 ended with the shocking death of Arconia doorman Lester (Teddy Coluca), and now the trio is caught up in yet another complex murder mystery. Starring Martin Short, Steve Martin, and Selena Gomez, the series is streaming on JioHotstar.5/6​‘Saiyaara’Directed by Mohit Suri, this romantic musical drama tells the story of Krish Kapoor, an aspiring musician trying to find his place in the industry. His life changes when he collaborates with Vaani Batra, a shy poet recovering from heartbreak. Their creative bond rekindles both passion and love, but when Vaani is diagnosed with early-onset Alzheimer’s, their journey takes an emotional and unexpected turn. The movie is streaming on Netflix.6/6​‘The Girlfriend’This psychological thriller, based on Michelle Frances’ book, follows Laura, whose seemingly perfect life unravels when her son Daniel begins dating a mysterious young woman named Cherry. After a series of unsettling events, Laura suspects Cherry is a manipulative social climber hiding dangerous secrets. The series is streaming on Amazon Prime Video.Follow Us On Social Media Visual Stories   Photostories"
  },
  {
    "url": "https://timesofindia.indiatimes.com/tv/news/hindi/bigg-boss-19-farah-khan-slams-kunickaa-sadanand-for-making-comments-on-tanya-mittals-upbringing-and-her-mother-calls-her-control-freak/articleshow/123859288.cms",
    "title": "Bigg Boss 19: Farah Khan slams Kunickaa Sadanand for making comments on Tanya Mittal's upbringing and her mother ; calls her 'control freak'",
    "content": "Bigg Boss 19’s Weekend Ka Vaar will see host Salman Khan missing in action. However, the makers have ensured the entertainment quotient remains high by bringing in choreographer-turned-filmmaker Farah Khan to step in for Salman. And the Main Hoon Na director doesn't disappoint as she highlights the real topics of the week. The makers released new promos of the upcoming Weekend Ka Vaar, where Farah Khan is seen calling out Kunickaa Sadanand for her ‘bossy’ behaviourThe promos starts with Farah calling out Kunickaa for taking out food from Zeishan's plate and her attitude in the house. She says, \"Kunickaa ji ye joh aapka ghar mein aake rawaiya hai kisike plate se aapne ghana nikalwake wapas rakha, it is a shocker for us.\" (Kunickaa ji, the way you behaved in the house—removing food from someone’s plate and putting it back—came as a shocker to us.)'Bigg Boss 19': From TV favorites to Undertaker & Mike Tyson may join star-studded seasonShe further slams her for making comments on Tanya's upbringing. Farah says, \"Aap direct logon ke parrvarish par chali jaati hai... that is very wrong. Hamara yaa kisi ka haq nahi banta hai uss par tokna. Aapko lagta hai aap kabhi galat jaati he nahi hai (You directly question people’s upbringing, and that is very wrong. None of us, including you, have the right to comment on that. You behave as if you can never be wrong). And you are becoming a control freak.\" Kunickaa, like always, doesn't look convinced with Farah's statements and is seen making faces in the promo of the show.In another promo, she lashes out at Baseer Ali and Neha Chudasama. She reveals to the housemate that he called them shi* contestants and asked who she should bring him on the show. While schooling Nehal, Farah mentions how the things she is doing on the show are taking feminism back 100 years.Apart from Farah, the Weekend Ka Vaar episodes will also see Akshay Kumar and Arshad Warsi entering the BB house to promote their soon to be released film, Jolly LLB 3. Bigg Boss 15: Gauahar Khan threatens fans of Umar Riaz with police complaint for abusing her online"
  },
  {
    "url": "https://timesofindia.indiatimes.com/web-series/news/korean/from-queen-mantis-to-confidence-queen-korean-dramas-to-binge-watch-this-weekend/photostory/123859006.cms",
    "title": "From ‘Queen Mantis’ to ‘Confidence Queen’: Korean dramas to binge-watch this weekend",
    "content": "Newsweb-serieskoreanFrom ‘Queen Mantis’ to ‘Confidence Queen’: Korean dramas to binge-watch this weekendTrendingETimes.in /  Sep 13, 2025, 12:31 ISTAAText SizeSmallMediumLarge1/6From ‘Queen Mantis’ to ‘Confidence Queen’: Korean dramas to binge-watch this weekendIf you’re looking for fresh K-dramas to enjoy this weekend, there’s something for everyone. From revenge and crime to emotional stories of friendship and love, these shows bring strong characters and gripping plots. You’ll also find thrillers packed with action and clever scams full of fun. Whether you prefer heartfelt moments or high drama, these latest releases will keep you entertained and make your watchlist more exciting.2/6‘Queen Mantis’This intense revenge drama stars Go Hyun Jung and Jang Dong Yoon. It follows a woman known as ‘Queen Mantis,’ who comes face-to-face with her detective son when a series of copycat murders resurface. Blending family conflict with crime and vengeance, the show promises a gripping watch. Streaming on Netflix.3/6​‘My Youth’Song Joong Ki has returned! Playing a former child actor attempting to lead a quiet life, he makes a comeback in this charming romance. After a ten-year separation, things change when he meets up with Chun Woo Hee, who played his first love. Expect lots of nostalgia and slow-burn emotions. Streaming on JTBC, Viki.4/6​‘You and Everything Else’This slice-of-life drama traces the deep bond between two women, played by Kim Go Eun and Park Ji Hyun, as they grow from youth to adulthood. Their journey through love, heartbreak, and loss makes the story both heartfelt and relatable. Streaming on Netflix.5/6​‘Tempest’Set against a high-stakes political backdrop, this thriller stars Jun Ji Hyun and Gang Dong Won. A diplomat and a mysterious agent must work together to prevent a deadly attack that threatens Korea. With international tension, espionage, and action, Tempest is a must-watch. Streaming on JioHotstar.6/6​‘Confidence Queen’Park Min Young takes the lead in this stylish adaptation of a Japanese drama about three cunning scammers. Together, they target corrupt elites, each bringing a unique skill—intelligence, charm, or wit. Expect a thrilling mix of crime, fun, and clever schemes. Streaming on Prime Video.Follow Us On Social Media Visual Stories   Photostories"
  },
  {
    "url": "https://timesofindia.indiatimes.com/entertainment/k-pop/music/news/rewind-talks-about-what-their-music-is-about-ongoing-challenges-and-more-report/articleshow/123865329.cms",
    "title": "RE:WIND talks about what their music is about, ongoing challenges, and more. - Report",
    "content": "Rookie boy group RE:WIND just debuted with their EP titled ‘Re:Minisce’ last month. Recently, the members of the group got candid about their music and what went down behind the creation of their debut album.RE:WIND talk about what their album means to them and moreIn an interview with Allkpop, RE:WIND got candid about behind-the-scenes stories about their album, how life has been since debuting, and what their latest extended play means. While talking about how the album was made, the group shared that “We actually directly participated in writing the tracks ‘Heart, Break, Repeat’ and ‘We Got Time’ by hopping on calls with our producer David Kater to churn out the topline and lyrics. I think both sessions were like four hours of nonstop writing each.”They also shared that one of the members, Eddie, was majorly involved in creating the choreographies for their songs, specifically ‘Little Too Late.’ While talking about what they wish to share with fans with their new album, the members enthusiastically answered that they want people to feel nostalgic when they listen to their album. “We grew up on the tail end of the 2000s boy band and 90s R&B era, and we know that generation of music resonates with many of our listeners. Music is also ever-present in our highest and lowest moments, and we want to allow listeners to return to the past through these tracks,” they added on.RE:WIND talks about challenges faced in the industryThe group also discussed more about their experience in the industry for the past few months or so. They stated that, “Every day that we get to do a new activity or participate in a new part of the creative process is really exciting. This week, we got to meet fans in person for the first time as a group, and behind the scenes, every time we’re in the studio is a fresh experience.”"
  },
  {
    "url": "https://timesofindia.indiatimes.com/entertainment/k-pop/music/news/i-o-i-reunion-confirmed-kang-mi-na-to-sit-out-of-eventfans-shocked-over-the-news/articleshow/123864463.cms",
    "title": "I.O.I reunion confirmed: Kang Mi Na to sit out of event—Fans shocked over the news",
    "content": "It is official; I.O.I is all set and ready to reunite for a special event! The confirmation came only recently, citing that all of the members will get back together in order to celebrate their 10th anniversary since their debut. The group was formed temporarily after members were selected from the variety show ‘Produce 101.’ Fans had been excited about the reunion of all of the members of the group; however, a recent update about idol-turned-actress Kang Mi Na has left everyone reeling. Kang Mi Na to sit out of I.O.I reunionThe group is all set to reunite to celebrate their 10th anniversary next year since their debut in 2016. However, as per reports shared by Koreaboo released on September 12, not all of the members will be able to attend the reunion. Kang Mi Na, who recently appeared in the OTT film ‘Love Untangled,’ will not be able to attend the event next year due to scheduling conflicts. Her management agency also issued a statement regarding the same, stating that “The reunion period being discussed overlaps with both the filming of her upcoming drama and the promotional period of another project. We are fully aware of the fans’ long-awaited anticipation, and after thorough discussions with the artist, we decided to respect her wish to focus on acting. As a result, she will not be able to take part in the reunion activities this time.”Netizens and fans reactNetizens and fans have been expressing their disdain over the matter, with many saying how much they were expecting all of the members to get together one more time. One person’s comment read, “Didn’t they almost do it last time, too?\", while another mentioned that, “Get it, the group has so many members, so it's going to be hard to gather all the members.\"A third person also shared their opinion, stating that, “I get it; the group has so many members, so it's going to be hard to gather all the members.”"
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/asia-cup-after-bronco-a-new-drill-introduced-to-test-indian-cricketers-in-dubai/articleshow/123862785.cms",
    "title": "Asia Cup: After Bronco, a new drill introduced to test Indian cricketers in Dubai",
    "content": "Indian cricket team had an innovative fielding drill during the ongoing Asia Cup. (Image: Pratyush Raj/TimesofIndia.com)TimesofIndia.com in Dubai: \"Agar main dive maar raha hoon iska matlab main theek se move nahi kar raha (If I am diving it means, I am not moving and anticipating quickly),\" quipped India all-rounder Hardik Pandya after missing a catch.He was conversing with Team India fielding coach T Dilip, who had introduced a new drill for the Indian cricketers in the ongoing Asia Cup.TimesofIndia.com has learnt that Dilip had come up with the idea to enhance the ability of Indian cricketers to cut the gaps in the field.Why this special drill for Shubman Gill, Rinku Singh and Jitesh Sharma?It is like a goalkeeper's drill. There was a goalpost-sized safety net put up by T Dilip far away from the batting nets. The task for each fielder was to protect their goal. And interestingly, the catching practice was being done with the new balls. The reason behind using the new ball for this drill was that it travels quickly.Each player was taking two sets of five catches, and just like they bat in the nets, they were changing guards.Hardik Pandya, after missing one, pulled off a stunner and immediately rushed to the fielding coach T Dilip and gave him a tight hug. The Indian all-rounder grabbed another blinder, which even left Shivam Dube impressed, who was watching the action from close quarters.After Hardik, vice-captain Shubman Gill and Rinku Singh, fresh from completing their batting practice, joined the fielding coach.Rinku Singh during a fielding drill at the practice session in Dubai. (Image: Pratyush Raj/TimesofIndia.com)Gill was outstanding. He took four full-stretched catches — two to his left and two to his right — and left Rinku and Dilip stunned. The fielding coach shouted, \"You are making it a habit.\"Meanwhile, Rinku Singh struggled in his first set but bounced back in the second with a little help from Gill, who guided his former Kolkata Knight Riders (KKR) teammate, and then Rinku was off the blocks.They were followed by Abhishek Sharma and Tilak Varma.Abhishek's first question was, \"Isn't it too big?\" The fielding coach smiled and said: \"You can pull it off easily.\" And Abhishek did pass the test with flying colours. So did Tilak. The duo gave each other a fist pump before moving on to other fielding drills.Rinku wins a medalThe day started with all 15 Indian players divided into two groups.Each group was given three targets to hit. One was a full stump, the second was a half stump and then there was a back roller. It was Shivam Dube who hit the first target but it was Rinku Singh who won the drill. He was later awarded a medal by the fielding coach T Dilip.Bronco test settling down nicelyIf you’re physically prepared, you can play more seasons. The systems we put in place also minimise the risk of injuriesAdrian Le Roux on the Bronco testTeam India’s strength and conditioning coach Adrian Le Roux has shed light on the Bronco Test, the latest fitness assessment introduced for the players.It looked like the players have started to adapt to the new fitness drill. Under the watchful eyes of Le Roux, the players were doing the 60-metre sprint and they were doing it four times to cover 240 metres by sprinting back and forth in a set sequence.The Bronco Test, widely used in rugby, is designed to push players’ aerobic and cardiovascular capacity to the limit.\"We’ve now brought it into the team’s environment. It serves two purposes: we can use it as a training mechanism and also as a measurement. It gives us a clear picture of the players’ aerobic fitness and whether we’re moving in the right direction,\" Le Roux had told BCCI.TV recently.\"If you’re physically prepared, you can play more seasons. The systems we put in place also minimise the risk of injuries,\" he added.India will take on Pakistan on Sunday at the Dubai International Stadium."
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/the-loneliness-of-being-arshdeep-singh-why-team-indias-chill-guy-is-fighting-a-gruesome-battle/articleshow/123861942.cms",
    "title": "The loneliness of being Arshdeep Singh: Why Team India’s ‘chill guy’ is fighting a gruesome battle",
    "content": "Arshdeep Singh of India (Photo by Michael Steele/Getty Images)Dubai:Arshdeep Singh is a menace on social media these days. The 26-year-old is busy making vlogs, hyping his teammates’ performances, creating reels with them, giving fans glimpses of his personal life, and most importantly, taking care of his loved ones — his family.Go Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW! Arshdeep has been part of the Indian team across all three formats. In 2025, though, he has featured in only one ODI and three T20Is.India Asia Cup prediction: Why bad news could be in store for India | Greenstone Lobo predicts He was part of India’s Champions Trophy-winning squad, but Harshit Rana got the nod ahead of him in the playing XI. Later, Arshdeep was picked for the Anderson-Tendulkar Trophy and was all set to make his debut at The Oval in the final Test of the series. But he missed out to Prasidh Krishna, chosen for his experience and extra bounce. Imagine the heartbreak for a player whose parents travelled from Mohali, and whose elder brother flew in from Brampton, Canada, with his wife and infant, only to see him denied his Test cap. With 99 wickets in 63 T20Is, Arshdeep is India’s leading wicket-taker in the format. He played a vital role in India’s T20 World Cup triumph and was named ICC Men’s T20I Cricketer of the Year.PollShould Arshdeep Singh have been selected for the playing XI in the Asia Cup opener against UAE?Yes, he deserves a chanceNo, he doesn't fitNot sure, depends on form Yet, in India’s Asia Cup opener against hosts UAE, he did not play. There’s every chance he may again carry the drinks in the much-anticipated clash against Pakistan on Sunday. Somehow, Arshdeep always seems to miss the bus. Last month in Bengaluru, he played his first competitive game in three months — a Duleep Trophy clash after his IPL stint with Punjab Kings. After the Test cap snub at The Oval, the lanky pacer switched focus to the Asia Cup. “During the last Test at The Oval, I started training with a white ball. The workload was properly managed. I don’t know how many thousands of balls I sent down in practice. There was no shortage of bowling. At the end of the day, white or red ball, you just play and enjoy it. I got a chance to play in the Duleep Trophy and will next play with a white ball. The aim is to have a lot of overs under the belt,” Arshdeep told reporters while representing North Zone in the quarter-final. On Friday at India’s net session, he was the most vocal of the lot — cheering everyone from Rinku Singh to Shivam Dube to his Punjab teammates Shubman Gill and Abhishek Sharma. Despite being one of India’s finest left-arm seamers in recent times, he is struggling for opportunities under Gautam Gambhir’s regime.Arshdeep Singh warmed the bench in India's first game of the Asia Cup, against UAE, and could well do the same against Pakistan on Sunday.  (ANI Photo) “Everyone knows there is no agenda,” India batting coach Sitanshu Kotak said at the ICC Academy when asked about Arshdeep’s omission. “There is no personal liking or disliking. Whatever is best for the team, the captain and head coach will decide. And I don’t think there is any doubt in anybody’s mind. Whoever is not playing is always trying to help those who are, and I think that’s how the team should function.” In his brief career, Arshdeep has already faced too many swings of fortune. In 2022, he was brutally trolled after dropping Asif Ali in a tense Asia Cup chase against Pakistan. One user even modified his Wikipedia page to insert references to “Khalistan.” “His exact words were, ‘I am laughing at all these tweets and messages,’” his father Darshan Singh told TimesofIndia.com.Everyone knows there is no agenda. There is no personal liking or disliking. Whatever is best for the team, the captain and head coach will decideIndia batting coach Sitanshu Kotak on Arhsdeep's omission Being Arshdeep Singh in the current Indian set-up is not easy. He smiles constantly, but beneath it all, he has become a ticketless traveller, stuck in a lonely phase. Yet, he doesn’t need to look too far for inspiration. If he wishes, he can revisit his diary entries — a record of his cricketing journey, which he once described as his finest work. “Rakh rabb te yakeen naal mehnatan da zor hove. Apne aap nu kra challenge, mukabala na koi hor hove! Hovan saarean toh vakh, jitt hateran de dil lavan. Hon jinnia v aukdan, mukaam apne nu mil lavan!”(Have faith in the Almighty and work hard. Challenge yourself rather than competing with others. Be the best among the best and win over the hearts of haters. With dedication and effort, you will reach your destination, no matter how tough the circumstances are.)"
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/cricket/news/england-cross-300-in-t20i-phil-salt-and-jos-buttler-tear-apart-south-africa-in-record-win/articleshow/123861792.cms",
    "title": "England cross 300 in T20I - Phil Salt and Jos Buttler tear apart South Africa in record win",
    "content": "England batsman Phil Salt and Jos Buttler (Photo by Stu Forster/Getty Images)Phil Salt lit up Old Trafford with a record-breaking knock as England posted their biggest Twenty20 win by runs, crushing South Africa by 146 runs on Friday night. Salt smashed an unbeaten 141, the fastest and highest T20 century by an England batter, and shared a breathtaking opening stand with Jos Buttler. Together they fired England to 304 for 2, only the third time in history that a men’s team has crossed the 300 mark in T20 internationals. Buttler added 83 from just 30 deliveries, including a half-century in only 18 balls, the third quickest for England.Go Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW! South Africa, chasing history, never really looked in the contest. They were 64 for 3 after the powerplay and lost skipper Aiden Markram for 41 in the eighth over, which all but sealed their fate. The visitors were bundled out for 158 in the 17th over, suffering their heaviest defeat in the format. For Salt, the evening was unforgettable. “That was really good fun,” he said afterwards. “A personal milestone but the fact we got 300 and won by such a big margin, I can’t have asked for much more.”PollWhich record do you think is more significant from this match?Phil Salt's fastest T20 centuryEngland's highest T20 totalSouth Africa's heaviest defeat His innings included eight sixes and 15 fours, and he overtook Liam Livingstone’s record for England’s fastest century by reaching three figures in 39 balls. It was also his fourth T20 hundred for England, making him the only player in the side to go beyond one. England’s bowlers then enjoyed their share of success as Jofra Archer picked up 3 for 25, Sam Curran took 2 for 11 and Will Jacks struck twice at the end. The win sets up a decider in Nottingham on Sunday, with Harry Brook pleased about the preparation. “Every must-win game we have now leading to the T20 World Cup is awesome preparation for us,” he said. The night, though, belonged to Salt, who walked off unbeaten, applauded by a buzzing Old Trafford crowd after writing a fresh chapter in England’s white-ball story."
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/asia-cup-theres-a-lot-of-joy-in-beating-india-ex-sri-lanka-cricketer-russell-arnold/articleshow/123861847.cms",
    "title": "Asia Cup | 'There's a lot of joy in beating India': Ex-Sri Lanka cricketer Russel Arnold",
    "content": "NEW DELHI: Former Sri Lanka cricketer Russel Arnold acknowledges that nothing in cricket compares to the joy of defeating India. With the Asia Cup underway, Arnold feels Sri Lanka have the firepower to challenge — and potentially derail — India’s campaign if the two sides meet in the Super 4s stage of the Asia Cup. Arnold, who represented Sri Lanka in 44 Tests, 180 ODIs and one T20I, also said that bilateral series between India and Sri Lanka should be revived more frequently, as they used to be a regular feature in the past. He explained that the decline in bilateral contests was due to a packed international calendar and the growing participation of players in various franchise leagues across the globe.Go Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW! In this edition of the Asia Cup, India are placed in Group B alongside Pakistan, Oman and United Arab Emirates (UAE), while Sri Lanka are in Group A with Afghanistan, Bangladesh and Hong Kong. In an exclusive conversation with TimesofIndia.com, Arnold spoke about the Asia Cup, Sri Lanka’s chances, India being the team to beat, the importance of reviving India–Sri Lanka bilateral series, and much more...India vs Sri Lanka:FormatSpanMatchesWonLostTiedDrawTest matches1982–202246227017One-Day Internationals (ODIs)1979–2024171995920Twenty20 Internationals (T20Is)2009–20243221910How do you assess Sri Lanka national cricket team’s chances of winning the Asia Cup this year? I think they stand a good chance. It’s going to be very competitive, and I’m really looking forward to the tournament because it’s of high quality — especially with the Bangladesh national cricket team and, more recently, the Afghanistan national cricket team playing some wonderful cricket. Everyone is somewhat of a threat. The India national cricket team will probably be the team to beat, but the way Sri Lanka national cricket team are going about things, I think they’re on the right track. Players are coming together, settling into their roles, and hopefully they can perform at the high standard required to make it difficult for the other teams.Which three key Sri Lankan players do you think can be game-changers in this tournament?Pathum Nissanka, right at the top of the order, can set the tone. Kamindu Mendis is settling into his new role at number seven, and he’s going to be a real key for Sri Lanka national cricket team, whichever way their batting goes. And then I’ll go with Dushmantha Chameera, who’s fit and firing, to make an impact with the ball for Sri Lanka.Sri Lanka once dominated world cricket, but now Afghanistan national cricket team are emerging as the second-best team in Asia after India national cricket team. What, in your view, has caused the decline in Sri Lankan cricket? They’ve struggled with consistency. Now and then, they’ve produced good performances that make you take notice, but repeating those performances has been their biggest challenge. With so much cricket being played these days, having depth in the squad is crucial — and Sri Lanka seem to lack that depth. India, for example, can afford to rest and rotate players to keep them fresh. That kind of balance is vital for sustained success. In contrast, Sri Lanka often face injuries, and each injury feels like a major setback because they don’t have ready replacements. This disrupts their rhythm and puts them off their game. Building greater bench strength is one of the key challenges Sri Lanka must address to stay competitive consistently.Earlier, India and Sri Lanka used to play bilateral series quite frequently, sometimes even twice a year. That’s rare now. Do you think there should be more India–Sri Lanka series again? It’s always good to play India because it’s such an interesting and challenging series. But the packed schedules these days don’t allow for it as much. With the rise of franchise cricket, there simply isn’t enough time. It’s not like 20 years ago, when teams could fit in more fixtures and longer series. The landscape of cricket has changed completely. So, even if everyone wants it, time has become a major constraint. There are plenty of benefits to playing against India. They’re competitive, marketable and commercially very strong. That’s why every team around the world wants to play — and beat — them. India have set the bar so high, and there’s a lot other teams, including Sri Lanka, can learn from them. And of course, there’s great joy whenever we manage to beat them as well. So yes, if time permitted, it would be fantastic to play more matches against them — it would benefit the players and the bigger picture of running cricket too.Do you feel the growing preference for franchise leagues over national duty is one of the reasons for the decline in bilateral cricket between the two teams? Players, of course, would love to play for their countries. At the end of the day, they’re professional cricketers, and there’s only a limited window to build a life for themselves — because they give up on everything else for the game. So, if players make decisions based on securing their future, I have no problem with that. You’ve got to make the best decision for yourself, because in the beginning, it’s you and your family who are always there for you. Yes, cricket has changed, and the rewards are very different now. And if it means making a tough call to look after your family or to build a better life for them, then that’s the way you’ll go. I’m pretty sure that if those options were available to you, you’d have to make the same decision as well.Sanath Jayasuriya has come on board as Sri Lanka’s coach. Do you think his arrival could turn things around and possibly inspire the team to win the Asia Cup this time? Hoping so — that would make me very happy as well. But as I mentioned earlier, it’s going to be a massive challenge. You have to get past some quality teams, which means playing the best cricket possible. Sri Lanka do have the players and the skill; it’s about bringing it all together. What matters is how you perform on that particular day — and then being able to back it up the next day. Consistency is what’s required to get those results, and Sri Lanka have had some issues with continuity. Hopefully, they learn from their past mistakes. Sanath Jayasuriya’s passion and emotion can rub off on the players, and that high intensity can be maintained.The Asia Cup also serves as preparation for the upcoming ICC Men’s T20 World Cup in India and Sri Lanka next year. How important is this tournament in that context? That’s the beauty of the Asia Cup, isn’t it? We play the same format leading into the ICC Men’s T20 World Cup, so it gives you that opportunity. But for the players, yes, they need to clear their minds — take each day as it comes, go out there, express themselves, and make a name for themselves. When you start looking too far ahead — four or six months down the line — that’s where things go wrong. You cannot treat this as just a practice tournament. It’s an international tournament of high quality. There’s rivalry, there’s gamesmanship. You’ve got to go out there ready to play each day. Yes, in the bigger picture it serves as a warm-up, a chance to get things right. But every player out there will want to win this tournament — and that’s exactly how it’s going to be played.In the last Asia Cup final against India, Mohammed Siraj ran through Sri Lanka’s batting with a five-wicket haul. Do you think Sri Lanka have learned from that loss and are better prepared to bounce back this time? Well, they have struggled against Mohammed Siraj the last couple of times, haven’t they? But the players have changed, they’ve worked on their games, and they’ve learned from their mistakes — which is something I’m seeing in this Sri Lanka national cricket team. So, it’s not going to be as easy this time.What is your favourite memory from playing against India? We used to play a lot, as you mentioned. But the best game I remember goes back to that match in Sharjah, when Sanath Jayasuriya scored 189 and put on a big partnership with me. Then we bowled out India national cricket team for a very low total — that was very special."
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/nfl/news/nfl-star-christian-mccaffreys-wife-olivia-culpo-shares-first-look-inside-baby-colettes-calming-nursery-designed-to-grow-with-her/articleshow/123862901.cms",
    "title": "NFL star Christian McCaffrey’s wife Olivia Culpo shares first look inside baby Colette’s calming nursery designed to grow with her",
    "content": "Christian McCaffrey and Olivia Culpo (Image via Getty)Olivia Culpo, former Miss Universe and NFL star Christian McCaffrey's wife, has unveiled the first look at their daughter Colette’s nursery—a tranquil space designed to be both timeless and deeply personal. Crafted with a neutral foundation and layered with soft textures, the room mirrors the couple’s desire for calm during newborn days while promising the flexibility to grow with their child. More than just décor, the nursery reflects a love story evolving into parenthood, blending warmth, functionality, and football-season resilience.Olivia Culpo’s peaceful vision for baby Colette’s nurseryOn Saturday, Culpo shared a carousel of photos and videos revealing the finished nursery, even featuring a cameo from the couple’s dog Oliver. “My goal for Colette’s nursery was to create a space that felt soothing and timeless with a neutral foundation since we didn’t know the gender,” she wrote in her caption. With the Crate & Kids Design Desk team guiding her, the nursery became a curated blend of gentle tones, natural wood, and airy fabrics that invite peace into the whirlwind of newborn life. Fans instantly filled the comments section with admiration, leaving notes like “so beautifully created” and “how beautiful.”A room built to grow with baby ColetteBeyond aesthetics, Culpo emphasized longevity. “The design feels soft and calming for these newborn days but flexible enough to evolve as she grows,” she added. Every choice—from the transitional crib built to last through toddler years to the understated wallpaper with subtle forest motifs—was made with the future in mind. The space functions as a blank canvas, one that can adapt to new milestones while preserving the heart of these early months.Comfort and functionality shape every corner of nurseryThe nursery isn’t just about beauty; it’s built for daily rhythms. A rocking chair anchors the room, giving Culpo a place to nurse, comfort, and connect with her baby. The changing station, carefully fitted with storage and a mirror, turns a necessity into a moment of interaction, letting Colette look up while her parents lean in. Each piece has been selected to hold both practicality and memory, creating a space where parenting rituals feel anchored in love.Parenthood becomes a tender new chapter for the coupleFor McCaffrey, who just weeks ago was navigating training camps and NFL headlines, stepping into fatherhood has given life a different kind of intensity. Culpo calls the nursery “the perfect blank canvas, ready to grow with Colette and hold all the little moments that will make it ours.” It’s a glimpse of how their lives are evolving—from stadium roars to late-night lullabies—offering fans a tender chapter in the story of one of football’s most celebrated couples.Also read: Chiefs' heiress Gracie Hunt shares breathtaking family moments at Iguazu Falls that captivate NFL fans worldwide"
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/nfl/news/joey-porter-jr-deshon-elliott-and-derrick-harmon-out-but-steelers-are-ready-to-take-seahawks-head-on/articleshow/123863078.cms",
    "title": "Joey Porter Jr., DeShon Elliott, and Derrick Harmon out, but Steelers are ready to take Seahawks head-on",
    "content": "Joey Porter Jr. of the Pittsburgh Steelers looks on against the New York Jets (Image Source - Getty Images)The Pittsburgh Steelers are set to take on the Seattle Seahawks on September 14, 2025, looking to kick off the season with a 2-0 record after their exciting 34-32 victory against the New York Jets in Week 1. Even with injuries keeping key defenders Joey Porter Jr., DeShon Elliott, and Derrick Harmon off the field, coach Mike Tomlin is still feeling optimistic.This game has a bit of a revenge angle, as DK Metcalf will be up against his old team following a trade in March 2025. Seattle, under the leadership of Sam Darnold, is eager to bounce back from their 17-13 defeat to the 49ers. Pittsburgh’s strong roster, featuring Jalen Ramsey and Darius Slay, is gearing up to take on Seattle’s fierce offense.Joey Porter Jr. suffers hamstring injury in Steelers Week 1 win over New York Jets Joey Porter Jr., who is the starting cornerback for the Steelers and was picked in the second round of the 2023 draft from Penn State, hurt his hamstring in the second half of the Week 1 victory against the Jets on September 7, 2025. The injury happened while he was covering a route, which made him leave the game after only 18 out of 19 snaps in the secondary.He couldn't make it back, and the Jets took advantage of his absence in the high-scoring game. After the game, Tomlin spoke to reporters in East Rutherford, New Jersey, \"Joey tweaked his hamstring — we'll evaluate it, but it's the usual bumps and bruises.\"However, Porter did not participate in practice all week (DNP on Wednesday, Thursday, and Friday), leading to his official \"out\" designation on the Friday report. ESPN's Brooke Pryor reported the ruling via X.Pittsburgh Steelers safety DeShon Elliott suffers MCL sprain after awkward tackle by Breece HallSafety DeShon Elliott, who joined the team as a free agent from the Miami Dolphins in the 2024 offseason, suffered a knee injury classified as an MCL sprain during the second quarter of the game against the Jets. This occurred during a run play with Jets running back Breece Hall, where Elliott's left knee twisted awkwardly after another player collided with the side of his leg while he was tackling outside the pile.He was assisted off the field and didn't come back, with veteran Chuck Clark taking his place. Tomlin talked about it after the game on September 7, 2025, telling CBS Sports' Tracy Wolfson on the sidelines, \"DeShon's got a knee issue—we'll get imaging, but he's out for now.\"Elliott was marked as DNP all week and was officially ruled out in Friday's report. A doctor who knows the team confirmed the diagnosis, telling the reporter, \"Elliott's MCL sprain should sideline him 2-4 weeks, similar to Harmon's timeline.\"Elliott himself posted on Instagram on September 12, 2025, \"Be back soon—minor setback for a major comeback,\" addressing fans directly.Derrick Harmon dealing with MCL sprain after preseason injury against Carolina PanthersNewbie defensive tackle Derrick Harmon, who was Pittsburgh's first-round selection (No. 18 overall) in the 2025 NFL Draft from Oregon (via Michigan State), has been coping with an MCL sprain since the preseason finale against the Carolina Panthers on August 21, 2025.The injury happened in the second quarter when Harmon took a weird fall while trying to tackle quarterback Jack Plummer during a clash with an offensive lineman. He was taken off the field on a cart, and Tomlin shared with reporters after the game at Acrisure Stadium, \"Derrick has a knee sprain of some description—he's being evaluated.\"Harmon completely missed Week 1 and was DNP all week as he headed into Week 2, getting an \"out\" status on the Friday report.ESPN's insider Adam Schefter mentioned that the sprain would keep him out for roughly a month, which matches up with his ongoing absence.As a newcomer, Harmon demonstrated potential during training camp, receiving compliments from defensive line coach Karl Dunbar, \"Derrick's explosive—he's going to be a force inside.\" His stats from college include 85 tackles and 5.5 sacks, but the injury has delayed his NFL impact.Brandin Echols expected to fill in for Joey Porter Jr.Despite these absences, the Steelers are ready to face off directly. The secondary includes experienced players like Jalen Ramsey, who is expected to go up against Smith-Njigba, and Darius Slay, forming a solid pair to handle Seattle's passing game.Brandin Echols is expected to fill in for Porter, with Tomlin noting in his September 12 presser to WPXI's Jenna Harner, \"Echols has versatility—he can play outside or slot.\" The recent signing of Jabrill Peppers boosts our safety depth, as Tomlin shared with ESPN's Jeremy Fowler, \"Peppers is here because of Elliott's injury—he brings energy and experience.\" Up front, Cameron Heyward and Keeanu Benton will anchor the line in Harmon's stead.Rodgers' connection with Metcalf—who's up against his former secondary—might be crucial for the offense. Tomlin finished his Week 2 preview on Steelers.com, telling the digital media crew,\"Injuries happen, but we're built for this. Seattle's aggressive after their loss, but so are we.\"Also Read: “All the noise can only cloud what you’re trying to accomplish” — Tyreek Hill responds to alleged domestic violence claimsThe Steelers' use of 12 personnel (two tight ends) was quite high in Week 1 at 53.7%, which is a stark contrast to how Seattle's defense dealt with it last season, creating a fascinating tactical battle. Pittsburgh is favored by 3 points, and while injuries are tough, the depth of the team and Tomlin's 'next man up' approach have them set to strive for a 2-0 record."
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/nfl/news/it-cost-teair-tart-12172-to-slap-travis-kelce-in-brazil-heres-how-nfl-fines-actually-work/articleshow/123864251.cms",
    "title": "It cost Teair Tart $12,172 to slap Travis Kelce in Brazil | Here’s how NFL fines actually work",
    "content": "Teair Tart’s slap on Travis Kelce in Brazil just cost him $12,172. | Images via GettyLos Angeles Chargers defensive tackle Teair Tart has been fined $12,172 for slapping Kansas City Chiefs tight end Travis Kelce in the season opener in Sao Paulo, Brazil, according to ESPN. The penalty matches the NFL’s fine for a first striking offense.The slap came in the third quarter of the Chargers’ 27-21 win in Week 1. Travis Kelce shoved Teair Tart after a play, and Tart fired back with an open-handed shot to Kelce’s helmet. The officials flagged Tart for unnecessary roughness but stopped short of ejecting him because the contact was open hand and not a punch.Andy Reid questions why Teair Tart was not ejected after slapping Travis KelceKansas City Chiefs head coach Andy Reid made it clear he thought Teair Tart should have been tossed.\"I don't understand that rule,\" Reid said. \"I guess it's open hand, fist, whatever, I don't know. I don't know what their decision was on that. But he definitely got hit in the head pretty hard, whether it was an open fist or a closed fist.\"Rules analyst Terry McAulay backed up the officials during the broadcast, explaining that NFL rules only call for an ejection when a closed fist is used. The league is set to confirm all fines from Week 1 on Saturday afternoon.Teair Tart trolls Travis Kelce and Taylor Swift fans after the gameTeair Tart did not let the moment die down quietly. On Instagram, he posted a collage and wrote: \"I'm too swift with it even in Brazil…\". The caption was widely seen as a reference to Travis Kelce’s engagement to singer Taylor Swift.Fans flooded the post with Swift-related comments and even racist memes. Teair Tart piled on with a clip from Dave Chappelle’s Rick James skit, the one where James says “what did the five fingers say to the face?” before delivering a slap.For Tart, this was also a milestone outing. It was his first start with the Los Angeles Chargers since signing a one-year, $1.5 million contract in the offseason. He had one tackle and batted down two passes. Travis Kelce, on the other hand, finished with two receptions for 47 yards and a touchdown.NFL fine policy explains why Teair Tart’s slap on Travis Kelce cost $12,172According to the official NFL/NFLPA fine schedule, the penalty for a first offense involving striking, kicking, tripping, or kneeing is $12,172. The full list of violations is collectively bargained between the league and the players’ union and is enforced by the NFL’s Football Operations compliance team.Fines are issued when officials flag a play during the game, when teams submit questionable plays, or when the NFL’s Officiating Department identifies potential violations during postgame film review. In Teair Tart’s case, the infraction was immediately flagged and reviewed.Players are notified by letter, with an explanation of the play, the rule they violated, and how much it will cost them. They also receive video evidence and information on how to appeal. If the player does not appeal, the amount is deducted from their next game check.Appeals are heard by one of three current appeals officers: Derrick Brooks, Ramon Foster, or Jordy Nelson. They are jointly appointed and paid by the NFL and NFLPA. Each case is assigned at random, and once a decision is made, it is final.Importantly, none of the fine money goes to the league. All fines collected are split between the Professional Athletes Foundation, which supports retired players in need, and the NFL Foundation, which funds health and wellness programs for athletes and youth football across communities.Each year, roughly $4 million in fine money is directed to these causes.Los Angeles Chargers and Kansas City Chiefs will meet again in DecemberThe slap did not change the outcome. The Los Angeles Chargers still walked away with a 27-21 win over the Kansas City Chiefs to open the AFC West race. Teair Tart got the last laugh on the scoreboard.The rivalry is far from over. The Chargers and Chiefs are set to clash again in Week 15 on Dec. 8 in Los Angeles, a rematch already circled by fans."
  },
  {
    "url": "https://timesofindia.indiatimes.com/sports/nfl/news/warriors-draymond-green-delivers-cold-reality-check-to-josh-allen-believers-after-epic-bills-comeback-hes-not-the-guy/articleshow/123862207.cms",
    "title": "Warriors’ Draymond Green delivers cold reality check to Josh Allen believers after epic Bills comeback: “He's not the guy”",
    "content": "Draymond Green’s Opinion Of Josh Allen (Getty Images)The Buffalo Bills head into Week 2 of the NFL season riding high after a dramatic 41-40 comeback win over the Baltimore Ravens. Quarterback Josh Allen once again showcased his brilliance, throwing for nearly 400 yards and adding two rushing scores. Yet, not everyone is convinced he can lead Buffalo to the promised land. Golden State Warriors star Draymond Green has made his doubts loud and clear, and his words are sure to stir debate among football fans.Draymond Green doubts Josh Allen’s ability to “be the guy”Speaking with NFL insider Jordan Schultz, Green did not mince words when asked about Allen’s standing among top quarterbacks. “He’s not the guy,” Green said bluntly. “Yeah, no. And like I said before, Josh Allen is like a damn good quarterback, but just because he’s a damn good quarterback, don’t make you a guy. He’s never going to get it done when it matters the most.”Green, a four-time NBA champion, pointed out that true greatness is defined by postseason success. For him, Allen’s lack of a Super Bowl appearance overshadows his regular-season heroics. “Jalen Hurts is the guy. Patty Mahomes is the guy. Josh Allen isn’t the guy, when it matters the most,” Green added. “By the way, they can go at me all they want until they win a Super Bowl, I’m right.”His comments came despite Allen’s spectacular Week 1 performance, which many considered a statement game to open Buffalo’s season.Do Josh Allen’s playoff struggles justify Green’s criticism?While Green’s assessment may sound harsh, the numbers do highlight a frustrating truth for the Bills. Allen has made 13 playoff starts but has yet to reach the Super Bowl — the most postseason starts without an appearance for any active quarterback. Time and again, Patrick Mahomes and the Kansas City Chiefs have blocked Buffalo’s path, leaving Allen and his team stuck on the outside looking in.That said, Allen’s individual playoff performances have rarely been the issue. He owns a strong passer rating of around 100 in the postseason, with big plays both through the air and on the ground. In many of Buffalo’s exits, the defense has faltered at critical moments, making it difficult to pin all the blame on the quarterback.For now, Green’s critique hangs over Allen’s legacy. Regular-season magic has never been in question, but until Buffalo breaks through with a Super Bowl run, skeptics like Green will keep questioning whether Allen is truly “the guy.”Also Read: \"Eliminate distractions\": Julian Edelman spills truth on Bill Belichick’s no-nonsense dating advice before coach’s romance with Jordon Hudson"
  },
  {
    "url": "https://timesofindia.indiatimes.com/life-style/parenting/moments/having-too-many-or-too-few-friends-what-your-childs-social-circle-say-about-his-personality/articleshow/123825833.cms",
    "title": "Having too many or too few friends: What your child's social circle say about his personality",
    "content": "What Your Child's Friendship Circle Reveals About Their Personality: Insights from Psychology (Image: iStock)Parents often notice whether their child is the life of the party with dozens of friends or the quiet soul who prefers just one or two close companions but have you ever wondered what does the size of your child’s social circle really say about their personality? Psychologists suggest that friendships are not just about popularity, they are windows into temperament, coping styles and emotional well-being.A child’s social circle often reflects their coping mechanisms and comfort zones. Some thrive in chaos and variety while others in consistency and intimacy. A 2017 research paper published in the Journal of Youth and Adolescence found that children’s friendship patterns strongly correlate with personality traits like openness, agreeableness and emotional stability.A child’s social circle, whether big or small, offers important clues about their personality, preferences and needs. Many friends may indicate extroversion and adaptability, while fewer friends often reflect introversion and a focus on depth. Here's what studies say about children with large versus small friend groups and why neither extreme is necessarily good or bad.The child with many friends: Extroversion and social confidenceChildren with larger social networks often thrive in group settings, showing confidence, adaptability and strong communication skills. Reviews of decades of studies have concluded that extroversion correlates with social leadership and peer acceptance in school environments. According to a 2006 study published in the Journal of Personality and Social Psychology, extroverted children were more likely to maintain wider friendship networks and these networks provided more opportunities for social skill development. A 2012 study in the Journal of Personality found that extroverted children tend to seek broader peer networks, gaining more opportunities for social learning but sometimes facing peer pressure risks.However, while being popular may seem positive, constantly juggling many relationships can sometimes reduce the quality of interactions. A 2011 Journal of Youth and Adolescence study found that popular children with very large peer groups often faced higher exposure to negative peer influence, including risk-taking behaviours. As per a 2013 study in Developmental Psychology, children with large but less close peer networks often experienced higher stress levels and less emotional support. In a 2015 study in the Developmental Psychology Journal, researchers observed that children with very large networks may experience superficial ties, which offer less emotional support compared to deeper friendships.The child with few friends: Depth over breadthHaving just one or two close friends often reflects introversion, thoughtfulness or a preference for deeper emotional bonds. A 2012 study in the Journal of Applied Developmental Psychology reported that children with one or two strong friendships show better emotional adjustment than children with many acquaintances. A 2014 study in The Child Development Journal highlighted that children with fewer but high-quality friendships report greater life satisfaction and lower loneliness than those with many shallow connections. As per a 2015 study in Merrill-Palmer Quarterly, introverted children who invest in a few close friendships benefit from stronger peer support, which buffers against school stress.However, too few friends can also mean social withdrawal. Though some children are content with a small circle, extreme isolation may signal anxiety or social difficulties. A 2005 study in the Journal of Abnormal Child Psychology found that chronic peer exclusion or having no close friendships predicted higher levels of depression and loneliness during adolescence. This was backed by a later 2016 study in the same journal, which reported that persistent social withdrawal in children can predict higher risks of anxiety and depression in adolescence if not supported by family or mentors. A 2019 study in the Journal of Child Psychology and Psychiatry. noted that children with persistently small or no peer networks were more vulnerable to bullying, which magnified mental health risks.Friendship quality with trust, empathy and support is a stronger predictor of long-term well-being than friendship quantity. A 2018 study in Journal of Early Adolescence showed that students with high-quality friendships had lower levels of peer victimisation and higher academic engagement, regardless of how many friends they had. Hence, it is important to balance between friendship quantity and quality because having many friends may mean more social exposure but risk of superficiality or peer pressure while having few friends may mean deeper support but risk of loneliness if bonds are missing.Neither is inherently better; what matters most is whether the child feels supported, connected, and secure in their friendships. For parents, the key is not to push children into more or fewer friendships but to nurture the quality of the bonds they do have. After all, it is not the number of friends that defines a child’s happiness but the strength of the connections that sustain them."
  },
  {
    "url": "https://timesofindia.indiatimes.com/life-style/beauty/sculpt-define-illuminate-why-face-workouts-and-semi-permanent-eyeliner-are-changing-the-beauty-aesthetic-game-in-india/articleshow/123853128.cms",
    "title": "Sculpt, define, illuminate: Why face workouts and semi-permanent eyeliner are changing the beauty aesthetic game in India",
    "content": "(Image Credits: Pinterest)In a world where beauty trends evolve faster than your Instagram feed, there’s a quiet revolution underway—one that doesn’t shout transformation but whispers refinement. At the heart of this shift are face workouts and semi-permanent eyeliner—two modern rituals reshaping how we define beauty. Face Workouts: The New Gym for Your SkinMove over, jade rollers—face workouts are the new frontier in non-invasive skin sculpting. These advanced, technique-driven sessions work the 40+ muscles of the face to lift, tone, and detoxify. Think of it as Pilates for your cheekbones—equal parts indulgent and effective. Six signature Face Workouts are curated to meet a spectrum of skin goals:Lymphatic Drainage – A gentle detox that de-puffs, energises, and resets your skin.Buccal Massage – The insider favourite — performed inside the mouth to deeply release jaw tension and sculpt facial contours.Hydrate & Tone – Drenches dehydrated skin in moisture, restoring bounce and glow.(Image Credits: Pinterest)Sculpt & Define – Precision massage techniques to contour cheekbones and tighten the jawline.Face HIIT – A vigorous circulation booster that leaves you instantly radiant.Slow Reset – A therapeutic unwind for stressed facial muscles — easing fine lines, tension, and fatigue.Results: An immediate post-glow, but the true magic is cumulative: firmer skin, enhanced elasticity, and visible lift with regular sessions. It’s not about overdoing — it’s about retraining your face the natural way.Top 10 tips for achieving acne-free clear skinSemi-Permanent Eyeliner: The Effortless Eye RevolutionImagine waking up every day with perfectly defined eyes—no smudging, no reapplication, no fuss. Eyeliner isn’t just makeup — it’s artistry, redefined through the lens of aesthetic precision and luxury care.What makes this method stand out?Custom Design: From subtle lash enhancements to smoky wings, every stroke is tailored to your eye shape and preferences.Smudge-Proof & Waterproof: Ideal for busy professionals, brides, and wellness enthusiasts.Minimal Downtime: Healing in 5–7 days; results last 12–24 months.This isn’t a harsh tattoo — it’s a soft, natural enhancement that frames your eyes without overpowering your features.(Image Credits: Pinterest)Beyond Skin Deep: Nail Strengthening and AI-Driven Skin AnalysisBeauty isn’t skin-deep — it’s layered, intelligent, and long-term. AI Skin AnalysisBefore any facial begins, it's important to analyse your skin with cutting-edge diagnostic tech that measures hydration, pigmentation, pore size, texture, and sebum activity. This allows one to craft personalised, clinically guided treatments, bridging technology with tailored luxury.Nail Strengthening Therapy This is not your average manicure. If you’re dealing with brittle, over-filed, or damaged nails, the nail rehab protocols use keratin-infused products, builder gel overlays, and targeted cuticle repair. It's a healing ritual, helping nails grow stronger, healthier, and more naturally beautiful over time.Where Science Meets SubtletyWhat ties all these innovations together is a shared philosophy: enhancement, not alteration. Face workouts, semi-permanent eyeliner, AI-driven diagnostics, and nail-strengthening therapy represent a new age of self-care: one that’s personalised, rooted in science, and consciously luxurious.Inputs by: Payal Jain Goyal, Founder and CEO, The Face Company"
  },
  {
    "url": "https://timesofindia.indiatimes.com/life-style/food-news/punjab-seeks-gi-tag-for-amritsari-kulcha-what-makes-it-special/articleshow/123854604.cms",
    "title": "Punjab seeks GI tag for Amritsari Kulcha: What makes it special",
    "content": "The Punjab Food Processing Department is seeking a Geographical Indication (GI) tag for Amritsari Kulcha, a popular local flatbread. This move aims to enhance the city's culinary identity, boost exports, and create job opportunities. Amritsari kulcha, a flavorful dish made with refined flour and various fillings, holds a special place in Amritsar's culinary heritage.Every state is known for its signature culinary treat that sets it apart from others. And when we talk about Punjab and its local flavors, mentioning Amritsari Kulcha is inevitable. As per the latest reports, the Punjab Food Processing Department is exploring the possibility of securing a Geographical Indication (GI) tag for the Amritsari Kulcha, the local tandoori bread of the holy city, which is celebrated in the national capital too.For the unversed, a GI tag is a label given to products that have a unique quality, reputation, or characteristic due to their specific geographical origin, such as a region, town or country.It has been reported that Rakhee Gupta Bhandari, the state’s Principal Secretary, Food Processing, chaired a meeting at Guru Nanak Dev University, Amritsar, where she said that GI tag of the Amritsari Kulcha will enhance the city’s culinary legacy and unlock new opportunities for branding, exports, and market expansion, ultimately to the creation of more job opportunities.What is the Amritsari Kulcha and what makes it special?According to Taste Atlas, Amritsari kulcha is a flatbread made with refined flour (maida) stuffed with potatoes, onions, cottage cheese, and spices. The flatbread is commonly garnished with coriander seeds, cilantro, and red chili powder. Thin, crispy, and smeared with ghee butter, it is a staple food in Amritsar, with almost every shop in the city sizzling with the sound of kulchas baked in large tandoor ovens. The website also states that not much is known about the history of this flavorful dish, and even the locals say that kulcha is just something they have always eaten, a variation on numerous flatbreads that the country is known for.As per food experts, a lulcha is typically stuffed with spiced mashed potatoes (aloo), cauliflower (gobhi), cottage cheese (paneer), onions, or even keema (minced meat) in non-vegetarian versions and often served hot with chhole, tamarind chutney, pickled onions, and sometimes yogurt or dal.Traditionally, it is made with maida but with the rising health concerns now the market also witnesses kulcha made with sooji, which is served with soya keema as a rich source of fiber and protein. And then there is a variation, which is called Tari wale Chole Kulche, where the kulcha is dunked in a gravy of chole, before it is served.History and origin story of the Amritsari KulchaAs per legends, the origin of tandoors could be traced back to the era of the Indus Valley civilization and it is believed that naan is the beginning of stuffed kulcha. And the connection of Amritsar and Kulcha is said to be over 200 years old.It is also said that there was a connection between Amritsari Kulcha and Emperor Shah Jahan. And as per some experts, kulcha may have been influenced by the techniques of khameeri roti (fermented bread).Types of KulchaPathi kulcha: Pathi Kulcha is a simpler, more basic version of kulcha that is typical of Amritsar. It is traditionally made using basic ingredients like white flour and water and baked in wood-fired clay ovens. It is said that it originated in the city some time in the 1920s.Aloo Kulcha: This is the most famous one, where kulcha is stuffed with spiced mashed potatoes, onions, and herbs and is often served with chole.Paneer Kulcha: This variety of kulcha is filled with grated paneer, spices, and coriander. It is soft inside with a creamy, mildly spiced filling.Onion Kulcha: This kulcha is filled with finely chopped onions, green chilies, and masalas and is known for its sharp, tangy-sweet bite.Gobi Kulcha: As the name suggests, it is stuffed with grated cauliflower and spices. It is a popular winter specialty in North India.Keema Kulcha: This one is loved by non-vegetarians and is filled with spicy minced mutton or chicken.How to make kulcha at home without tandoorIngredients 2 cups all-purpose flour (maida)2 tbsp yogurt (curd)2 tbsp oil or ghee1 tsp sugar½ tsp baking powder¼ tsp baking soda½ tsp salt½ cup warm milk (adjust as needed for kneading)butter or ghee (for brushing)chopped coriander / nigella seeds (kalonji) for topping (optional)MethodIn a bowl, mix flour, sugar, salt, baking powder, and baking soda.Add yogurt, oil/ghee and mix well.Slowly add warm milk and knead into a soft dough.Cover with a damp cloth and rest for 2–3 hours.Divide dough into small balls.Roll out into medium-thick discs.Sprinkle chopped coriander or nigella seeds on top and roll lightly again.Heat a tawa/griddle on medium-high flame.Place kulcha, cook until bubbles appear, then flip.Press lightly for even cooking.You can cook directly on flame for a tandoor-like effect.Brush with butter or ghee once done. Serve hot with chole.All Images Courtesy: istock"
  },
  {
    "url": "https://timesofindia.indiatimes.com/etimes/trending/emotional-support-alligator-in-pennsylvania-goes-from-restaurant-vip-to-walmart-ban/articleshow/123858121.cms",
    "title": "Emotional support alligator in Pennsylvania goes from restaurant ‘VIP’ to Walmart ban",
    "content": "Credit : WCNC/YouTubeIn West Brownsville, Pennsylvania, shoppers weren’t expecting to share the aisles with a five-foot alligator in a grey dress. But that’s exactly what they encountered when Wesley Silva wheeled his emotional support reptile, Jinseioshi, through a Walmart earlier this month. The unusual outing caused such a stir that the company has now barred the pair, despite Silva’s insistence that the gator has long been welcomed elsewhere.From VIP treatment to a Walmart banSilva, 60, told WPXI that public outings with Jinseioshi have usually drawn positive attention. “We’ve gone to restaurants,” he said. “We’ve been to Denny’s, where she’s a star there. She gets VIP treatment.”But Walmart didn’t share the same enthusiasm once photos of the reptile shopping trip began circulating. Customers snapped pictures of Jinseioshi dressed in outfits, including a shirt with a harness, while Silva pushed her in a cart.Credit : WCNC/YouTube“The safety of our customers and associates is our highest priority,” Walmart said in a statement to WPXI. “We welcome service animals in our stores, but it is unacceptable to expose members of the public to potential danger. Accordingly, alligators are not permitted on our premises.”According to the retailer’s website, only dogs and miniature horses qualify as service animals under the Americans with Disabilities Act. Silva admitted he was disappointed but chose not to push back. “I’ll just go with the flow,” he said.A legal but unusual companionSilva explained that he adopted Jinseioshi about four years ago after his neighbor, who received the animal as a gift, couldn’t care for her. “I did some research, I have kids of my own, and I didn’t want to put anyone in jeopardy, and after some research, I was like, you know what? I’ll take her,” he told WPXI.Credit : WCNC/YouTubeSince then, he has made a habit of bringing her on walks and into restaurants, describing the response as “very positive.” He has no plans to stop those outings despite Walmart’s ban.The National Wildlife Federation notes that alligators can grow to more than 12 feet long and weigh up to 1,000 pounds. Even so, the Pennsylvania Fish and Boat Commission confirmed to WPXI that owning one is not prohibited.This is not the first time an emotional support alligator has made headlines in Pennsylvania. In 2023, a Philadelphia Phillies fan was turned away at Citizens Bank Park after trying to enter with his reptile at the stadium gates."
  },
  {
    "url": "https://timesofindia.indiatimes.com/etimes/trending/viral-dutch-woman-shares-tips-for-first-time-travel-in-india-netizens-react/articleshow/123858356.cms",
    "title": "Viral: Dutch woman shares tips for first-time travel in India, netizens react",
    "content": "Image credits: Instagram/ivanaperkovicofficialPeople from across the world travel to India and share their reviews and tips on travelling across the country. From positive to negative, people have all kinds of experiences while visiting the Indian subcontinent. However, in the midst of a thousand social media posts sharing tips for people travelling to India for the first time, one post has caught the eye of many for its unique claims.A Dutch woman named Ivana who is not just travelling in the country but also living in it, recently took to Instagram to share a detailed post about her life in the country, sharing things she had known before. From Indian families to sarees and rickshaw struggles Ivana had a say for it all and netizens are loving her reviews.Indian valuesTitled '10 things I wish I knew before coming to Indian for the first time' the post began with her appreciating India's hospitality with the saying 'Atithi devo bhava' advising the travellers to 'be prepared to be fed to death'She also shared how much Indians value family which is something one can only understand after spending time with them. 'So def try to befriend local people and see how they live.'Travel tipsImage credits: Getty ImagesAnother interesting tip Ivana shared was her experience visiting one of the seven wonders of the world, the Taj Mahal. 'Taj Mahal is quite difficult to reach. Plan a trip to Agra for 2/3 days in order to not have a lousy Taj experience. Some basic tips: be THERE at 6am for a foreigner ticket, but keep in mind Taj is closed on Fridays for prayer,' she wrote. She also revealed that the colour of the Ganga river in Rishikesh is 'minty green' and advised that if people plan to swim there then they should wear full clothes and watch out for currents and cold temperatures.Saree experiencesIvana shared that a saree is difficult to wear if not worn before but once worn, it's highly comfortable and advised taking help from an elder aunt or at a salon.India is not overcrowdedImage credits: Getty ImagesOne of the biggest misconceptions people have about India is that it's overcrowded, which Ivana cleared with her statement. 'India is not overcrowded! There's plenty of space and 'slow' times. For the tourist places try to visit way before 10AM (like 8AM!) or you can go to more rural areas to escape all crowds. Be mindful of which places you visit without a guide though! Some places are even off limits for Indians.'Netizens react to Ivana's postPeople who are planning to visit or move to India have been thanking the influencer for her tips and experiences. \"Hi Ivana, just wanted to say that I absolutely love your content! I’m moving to India soon and have saved all your tips and infos, so helpful! Thanks for sharing such valuable insights 🙏\" wrote a woman in the comments.\"Such a good post, thanks Ivana! ❤️\" added another.\"Like you might have experienced, it's easier to eat with your hands (wash them beforehand obviously)\" wrote another, sharing their own tip."
  },
  {
    "url": "https://timesofindia.indiatimes.com/etimes/trending/most-dangerous-snakes-in-the-world-that-attack-in-silence-black-mamba-boomslang-russells-viper-and-more/articleshow/123864010.cms",
    "title": "Most dangerous snakes in the world that attack in silence: Black Mamba, Boomslang, Russell’s Viper and more",
    "content": "The world’s most dangerous snakes highlight how venom, not poison, defines their deadly nature. While “poisonous” is often misused, snakes are venomous—delivering toxins through specialized fangs with precise efficiency. This distinction matters because poisonous animals harm when touched or ingested, whereas venomous snakes actively inject their toxins into prey or potential threats, often with astonishing accuracy and rapidity.The impact of venom differs widely across species. Neurotoxic venoms can paralyze the nervous system, halting breathing and muscle function, while hemotoxic venoms destroy blood cells, rupture tissues, and cause internal bleeding. Some species possess venom so potent it can shut down multiple organ systems within hours. Combined with their stealth, speed, adaptive hunting strategies, and ability to sense heat or vibrations, venomous snakes remain among the planet’s most formidable, feared, and ecologically significant predators.World’s most dangerous snakes you won’t hear coming: Silent predators with deadly venomThe world’s most dangerous snakes are silent, stealthy predators that strike without warning. With venom capable of causing rapid paralysis, organ failure, or death, these serpents are masters of concealment, cunning hunting strategies, and surprise attacks. From dense jungles and humid rainforests to arid deserts and rocky landscapes, their deadly efficiency, extraordinary sensory adaptations, remarkable camouflage, and precise timing make them both feared and fascinating in the animal kingdom, commanding respect and awe from humans, researchers, and other animals alike.Black MambaSource: National GeographicThe Black Mamba of Africa is notorious not just for its speed but also for its aggression. Capable of moving up to 12 miles per hour, it is one of the fastest snakes globally. Its name does not reflect its body color, which is typically olive or grey, but the jet-black interior of its mouth, displayed as a warning before striking. This intimidating display often deters both predators and humans.The Black Mamba’s bite is extremely venomous, containing neurotoxins that can paralyze its victim within minutes. Before the development of antivenom, bites were almost always fatal. The snake’s ability to strike multiple times in rapid succession, delivering large amounts of venom, cements its reputation as a silent yet lethal hunter. Its combination of speed, precision, and potent venom exemplifies nature’s extraordinary power.BoomslangThe Boomslang is a highly venomous snake native to sub-Saharan Africa. Unlike aggressive snakes, it is shy and arboreal, often hiding among tree branches. Its name, which literally means “tree snake,” reflects its lifestyle, and its green or brown body provides perfect camouflage.Boomslang venom is hemotoxic, disrupting blood clotting and causing severe internal and external bleeding. Symptoms often appear hours after a bite, causing delays in seeking medical attention. Despite its shy demeanor, the Boomslang is deadly; even a single drop of venom can be fatal. Its stealth, patience, and lethal potential make it one of the most dangerous snakes operating quietly in the wild.Russell’s ViperThe Russell’s Viper ranks among the most dangerous snakes in Asia. Widespread across India, Sri Lanka, and Southeast Asia, it often lives near human settlements, increasing the risk of accidental encounters.Its venom is hemotoxic, causing severe internal bleeding, kidney failure, and shock. The snake’s camouflage allows it to remain motionless until provoked, making it easy for humans to unwittingly approach. Its combination of stealth, sudden strikes, and potent venom makes the Russell’s Viper a deadly threat, particularly for farmers and rural communities.Fer-De-LanceThe Fer-De-Lance is a highly feared pit viper in Central and South America. Known for its aggression and potent hemotoxic venom, it can cause massive internal bleeding and tissue destruction. A single bite may be fatal within hours without prompt medical care.This snake frequently hides in crops, tall grass, or near homes, increasing accidental encounters with humans. Its ability to strike with precision while remaining hidden makes it one of the leading causes of snakebite fatalities in its region. Awareness and caution are essential to coexist safely with this deadly predator.Saw-Scaled ViperThe Saw-Scaled Viper, though small, is highly lethal. Measuring under three feet, it contributes significantly to human fatalities. Found across Africa, the Middle East, and Asia, it often comes into contact with people working in fields or walking through brush.Its hemotoxic venom causes severe internal bleeding, tissue damage, and intense pain. Despite its size, it is responsible for more deaths than many larger snake species. Its combination of agility, aggression, and lethal venom makes it a silent and formidable predator.Coastal TaipanAmong Australia’s venomous snakes, the Coastal Taipan stands out for its speed, aggression, and potent venom. Capable of delivering a fatal bite to multiple humans, its venom causes paralysis, internal bleeding, and respiratory failure.Often found in sugarcane fields and rural areas, the Coastal Taipan remains hidden until it strikes with deadly precision. Immediate medical attention is crucial, and antivenom can dramatically improve survival rates.Tiger SnakeThe Tiger Snake is one of Australia’s most venomous snakes, recognizable by its striking stripes. Found near swamps, rivers, and coastal regions, it preys on frogs, birds, and small mammals.Its venom contains neurotoxins, coagulants, and myotoxins, which can cause paralysis, muscle damage, internal bleeding, and death within 30 minutes if untreated. Despite generally avoiding humans, it strikes quickly when threatened, using camouflage and stealth to ambush prey.Eastern Brown SnakeThe Eastern Brown Snake is responsible for the majority of snakebite deaths in Australia. Frequently found near human settlements, its slender brown body blends with the environment, making it nearly invisible.Its venom contains neurotoxins and powerful coagulants, capable of causing cardiac arrest, kidney failure, or severe brain damage. Fast, aggressive, and capable of multiple rapid strikes, it ranks among the most lethal snakes globally. Awareness, caution, and access to medical care are vital in areas where it is present.Why snakes kill in silenceSnakes are not naturally aggressive toward humans. Their venom evolved primarily as a survival tool to catch prey and defend themselves. Most species are shy and bite only when threatened, cornered, or accidentally provoked.Their stealth, patience, and camouflage allow them to ambush prey with remarkable precision. Human encounters often happen unexpectedly, which is why many bites occur. Observing these behaviors closely helps people appreciate snakes’ intelligence, adaptability, and ecological importance. Respecting snakes as highly evolved predators is essential, as they play a crucial role in controlling pest populations and maintaining the delicate balance of natural ecosystems.Venomous snakes: Pro tips to be safe from venomous snakesWhen living in or visiting snake-prone regions, precaution is essential. Wear protective boots in fields or forests, use flashlights at night, avoid provoking snakes, seek immediate medical attention if bitten, and learn to identify local venomous species. Quick access to antivenom dramatically increases survival chances.Venomous snakes—from the Black Mamba to the Inland Taipan—demonstrate evolution’s ability to create silent, highly efficient hunters. By respecting their space and observing their behavior, humans can coexist safely while appreciating the critical role these predators play in maintaining ecological balance.Also Read | Pacific Barreleye: The fish with a glass-like head and rotating eyes that track glowing prey"
  },
  {
    "url": "https://timesofindia.indiatimes.com/business/international-business/france-credit-downgrade-fitch-cuts-rating-to-a-from-aa-in-a-record-low-political-turmoil-clouds-debt-outlook/articleshow/123863190.cms",
    "title": "France credit downgrade: Fitch cuts rating to A+ from AA- in a record low; political turmoil clouds debt outlook",
    "content": "File photo: French President Emmanuel Macron (Picture credit: AP)France’s sovereign credit rating has been cut by Fitch to A+ from AA-, with the agency warning that public debt will keep rising until at least 2027 unless urgent corrective steps are taken. The move marks the lowest rating France has received on record from a major credit agency, though Fitch maintained a stable outlook for future moves, as per news agency AFP.The downgrade comes at a politically sensitive moment, just days after François Bayrou stepped down as prime minister following a failed parliamentary confidence vote over his austerity-driven budget. Bayrou reacted sharply on X, saying France was “a country whose elites lead it to reject the truth (and) is condemned to pay the price.” President Emmanuel Macron has since appointed Sébastien Lecornu to form a new government, though he faces a divided parliament with little room to push through deep spending cuts.Fitch said the confidence vote defeat showed how “fragmentation and polarisation” in domestic politics weakened France’s ability to deliver fiscal consolidation. The agency added it was unlikely the deficit would be reduced to 3% of GDP by 2029, contrary to earlier government ambitions.France recorded a budget deficit of 5.8% of GDP in 2024 and debt at 113% of GDP, far above eurozone thresholds of 3% and 60%. Fitch now projects debt to climb to 121% by 2027, with no “clear horizon” for stabilisation.Outgoing economy minister Eric Lombard acknowledged the downgrade but insisted on the “solidity” of the French economy. Rising borrowing costs are already evident: French 10-year bond yields reached 3.47% this week, close to Italy’s levels, though Italy carries a much lower rating. Analysts cited by news agency Reuters said the downgrade had largely been priced in, but warned it could spur forced selling of French bonds if other agencies follow suit. Rival rater S&P Global is due to update its assessment in November.For Prime Minister Lecornu, Fitch’s move heightens the challenge of presenting a new budget by early October. To secure support, he may need to soften plans with concessions such as higher taxes on the wealthy or easing pension reforms, though such compromises risk alienating Macron’s centrist base and conservative allies."
  },
  {
    "url": "https://timesofindia.indiatimes.com/business/india-business/erratic-behaviour-ex-us-nsa-john-bolton-slams-trumps-india-tariffs-rejects-claim-of-brokering-india-pak-peace/articleshow/123862493.cms",
    "title": "'Erratic behaviour': Ex-US NSA John Bolton slams Trump’s India tariffs; rejects claim of brokering India-Pak peace",
    "content": "John Bolton with Donald Trump (File photo) NEW DELHI: Former US National Security Advisor John Bolton has criticised President Donald Trump’s tariff policy on India, calling it “inappropriate” and an example of Trump’s erratic behaviour. He warned that such measures could strain ties between Washington and New Delhi. Bolton also criticised US President for repeatedly asserting that he brokered peace between India and Pakistan after the Pahalgam terror attack. India, however, has consistently maintained that the ceasefire resulted from direct talks between the Directors General of Military Operations (DGMOs) of both countries.Donald Trump’s 'Erratic' India Policy More Drama Than Strategy, Damaging US Credibility: John BoltonIn an interview with ANI, Bolton who has also served as US Ambassador to the United Nations said Trump’s decision to impose steep tariffs on India for purchasing oil and weapons from Russia reflected “erratic behaviour.” He pointed out that no similar measures were taken against larger buyers such as China, or other nations like Turkey and Pakistan.\"I think there was a lot of concern in Washington that the two tariff issues, combined with Trump taking credit for bringing peace to India and Pakistan after the last terrorist attack in Kashmir, were inappropriate,\" he said. The former security advisor further emphasised that India should prioritise long-term relations with the United States, noting that Trump’s presidency will last only another three and a half years.Last month, the Trump administration announced 25% reciprocal tariffs on Indian goods, along with an additional 25% levy linked to New Delhi’s energy trade with Moscow.\"The sanctions are not part of normal trade conversation, and it's part of Trump's approach to Russia's unprovoked aggression against Ukraine. This connection shows how erratic Trump could be because he has not sanctioned or tariffed Russia or violated the sanctions, nor has he sanctioned or tariffed China for violating the sanctions, and China is a much bigger purchaser than India is, and there are many other purchasers, Turkey, Pakistan, and others,\" Bolton said. He acknowledged that such steps would be frustrating for India but advised New Delhi to take a long-term view of relations with the US. Bolton stressed that India should treat Trump as a temporary factor, take decisions in line with its national interest and recognise that his actions do not represent the broader American view.Bolton also praised the Indian government’s handling of the tariff issue, noting that New Delhi’s quiet and measured response was the most effective way to deal with Trump. He added that avoiding public confrontations and relying on back-channel diplomacy helped prevent unnecessary escalation.The former US security advisor argued that Trump’s practice of pressuring even close partners like India was not a coherent strategy but more of a theatrical exercise aimed at domestic political gains. Such behaviour, he warned, has weakened global confidence in America’s reliability.Emphasising the need for a broader perspective, Bolton said India should focus on the long-term strength of its relationship with the United States, keeping in mind that Trump’s presidency will last only a few more years. He added that the goal should be to make steady progress, minimise damage during this period and rebuild once Trump’s term ends."
  },
  {
    "url": "https://timesofindia.indiatimes.com/business/india-business/104x-urban-companys-ipo-most-subscribed-offer-in-india-this-year/articleshow/123862700.cms",
    "title": "104x: Urban company's IPO most subscribed offer in India this year",
    "content": "BENGALURU: Urban Company's IPO was subscribed 103.6 times, making it India's most subscribed offer this year. The offer drew bids for 1,106.5 crore shares against the 10.6 crore shares on offer. The biggest push came from institutions.The qualified institutional buyers (QIB) portion was subscribed 140.2 times, led by both foreign and domestic funds. Foreign institutional investors applied for 264.9 crore shares, while domestic financial institutions and insurers bid for 319.7 crore shares. Mutual funds accounted for 56.7 crore shares. The non-institutional investor (NII) segment followed with 74 times subscription. The employee portion closed at 36.8 times. TNN"
  },
  {
    "url": "https://timesofindia.indiatimes.com/business/international-business/sergio-gor-us-envoy-designate-to-india-says-trade-deal-imminent-strategic-ties-intact/articleshow/123835086.cms",
    "title": "Sergio Gor, US envoy-designate to India, says trade deal imminent, strategic ties intact",
    "content": "TOI correspondent from Washington: US ambassador-designate to India Sergio Gor on Thursday said Washington and New Delhi are \"not that far apart” on tariff issues and indicated an agreement between the two sides is imminent. The upbeat assessment came even as he, along with top officials and lawmakers, talked up long-term strategic ties between the two countries that have been rocked by differences over trade matters. At a confirmation hearing before the Senate Foreign Relations Committee, Gor disclosed that President Trump has invited India’s commerce and trade ministers to visit US and they will be meeting with USTR Jamieson Greer in Washington next week. \"Part of that will include hopefully a deal. We are not that far apart right now... In fact, they're negotiating the nitty gritty of a deal,” Gor said. India-US Trade Deal Linked to Russian Oil: Donald Trump Envoy Sergio Gor Hints at Reset in RelationsAt a broader level, Gor and Secretary of State Marco Rubio, who unusually dropped by at the hearing to introduce ambassadorial nominees, tamped down on talk of a rupture in ties because of the protracted tariff dispute, asserting that \"India is among America’s TOP relationships for shaping the world’s future.” \"The story of the 21st century will be written in the Indo-Pacific. It’s so important that we have changed the name of the combatant command (from Asia-Pacific)...India is at the core of that,” Rubio said in his remarks, challenging reports, based on draft of the upcoming National Defense Strategy, that the Trump administration is dialing down commitments in the region in favor of a more isolationist posture. Gor also said President Trump remained committed to the Quad partnership with India, Japan, and Australia, without offering a firm date committment that the US President would visit the next Quad meeting, scheduled to be held in India later this year.He also spoke of the “deep friendship” Trump has with PM Modi saying it was “something unique.\"\"In fact, if you have noticed, when he has gone after other nations, he tends to go after their leaders for putting us in that position, and for the United States imposing those tariffs. When the President has been critical of India, he has gone out of his way to compliment Prime Minister Modi, they have an incredible relationship,” he said. PM Modi was conspicuously cool about Trump’s recent remarks on their personal friendship, emphasizing friendship between the two countries after the US President slapped punitive tariff amounting to sanctions against India for buying Russian oil. In fact, asked by Democratic Senator Jeanne Shaheen why India had copped tariff penalty and China had escaped it despite buying more Russian oil, Gor proffered the following explanation: “We hold our friends to different standards. Frankly, we expect more from India than we do sometimes from other nations.”There was no indication at any point during the hearing that Washington would ease pressure on New Delhi on the Russian oil issue despite all the upbeat sentiments about enhancing strategic ties. In fact, SFRC Chair Jim Risch, a Republican from Idaho, with a population less than that of a middling Indian city, told Gor that he must impress on India that the US \"will not tolerate support for Putin’s war machine.”Still, as several lawmakers expressed concern over the recent SCO summit where they perceived the leaders of Russia, China, and India getting close, Gor repeatedly asserted that the US and India had a lot more in common than they had with Russia or China. “If confirmed, I will ensure they (India) are pulled in our direction, not away from us,” he told lawmakers, some of whom spoke of his closeness to Trump and his direct access to the President."
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/artificial-intelligence/sam-altman-may-have-a-2-5-billion-plan-to-offer-access-to-chatgpts-premium-plan-for-free-to-all-users-of-this-country/articleshow/123483975.cms",
    "title": "Sam Altman may have a $2.5 billion ‘plan’ to offer access to ChatGPT’s premium plan for free to all users of this country",
    "content": "Sam Altman, the CEO and co-foudner of ChatGPT-maker OpenAI, has discussed a potential £2 billion ($2.5 billion) deal to offer free premium access to ChatGPT for all residents of the United Kingdom, a report claims. The proposal was reportedly discussed in a meeting with UK technology secretary Peter Kyle as part of a broader conversation about collaboration between OpenAI and the UK. A report by The Guardian cited two sources with direct knowledge of the meeting to claim that the The suggestion initially came up during a wider conversation in San Francisco about potential areas of collaboration between OpenAI and the UK. The report also notes that Kyle did not take the idea seriously, in part due to its high cost. However, the talks, highlight the UK government's enthusiasm for the AI sector, despite ongoing concerns about the technology's accuracy, privacy, and copyright implications.Currently, OpenAI offers both free and subscription-based access to ChatGPT. The paid plan, ChatGPT Plus, is priced at $20 per month and offers quicker responses along with early access to new features.What OpenAI said about ChatGPT Plus deal with the UKReferring to the UK being ranked among the company’s five biggest markets for paid ChatGPT subscriptions, an OpenAI spokesperson said: “Millions of Brits are already using ChatGPT every day for free. In July, we signed an MoU [a memorandum of understanding] with the government to explore how we can best support the growth of AI in the UK, for the UK. In line with the government’s vision of using this technology to unlock economic opportunity for everyday people, our shared goal is to democratise access to AI. The more people who can use it, the more widely its benefits will spread.”Apart from the US, the company recently held discussions with multiple governments and reached an agreement with the United Arab Emirates (UAE) to “enable ChatGPT nationwide,” integrating the technology into public sectors such as transport, healthcare, and education.As per UK government transparency data, Kyle met Altman for dinners in March and April. By July, Kyle had signed a non-binding agreement with OpenAI to explore the use of AI in UK public services, which could grant the company access to government data and potentially see its software applied in areas such as education, defence, security, and the justice system.“ChatGPT is fantastically good, and where there are things that you really struggle to understand in depth, ChatGPT can be a very good tutor for it,” the minister told PoliticsHome earlier this year."
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/artificial-intelligence/microsoft-report-shows-indian-companies-preparing-for-ai-led-future-of-work/articleshow/123700866.cms",
    "title": "Microsoft report shows Indian companies preparing for AI-led future of work",
    "content": "Microsoft has published a report which says that Indian companies are making major changes to how they prepare for the future of work, with most planning to bring artificial intelligence into daily business operations. According to the India findings of Microsoft’s 2025 Work Trend Index, 93% of business leaders in the country expect to use AI agents to support employees within the next 12 to 18 months.The study shows that many firms are already redesigning their operations to include human–AI collaboration. About 59% of leaders surveyed said their organizations are using AI agents to automate tasks across teams and business processes. Microsoft refers to such companies as “frontier firms,” which it says are setting the pace in adopting new work structures.Indian leaders are also signaling a wider reset in their strategies. Around 90% of business executives in India said this year is critical for rethinking business models, the highest figure globally. About 64% said they are prioritizing productivity gains through AI adoption, while a large majority confirmed they will use digital agents to expand workforce capacity in the near term.New roles are also emerging. Ninety-two percent of leaders said their companies are considering AI-focused positions such as workflow designers and software operators, while more than half expect teams to build multi-agent systems to manage complex functions. This shift is prompting companies to increase investment in training. Fifty-one percent of executives said upskilling will be their top focus over the next year, with 63% of managers expecting AI training to become a standard responsibility for teams within five years.Microsoft’s report also underlined India’s readiness. Two-thirds of employees and 80% of leaders in India are already familiar with AI agents, showing a workforce that is prepared to use AI as a partner in productivity.Globally, Microsoft reported that its Copilot applications now have more than 100 million monthly active users, the fastest adoption rate in the history of Microsoft 365. Across its portfolio, more than 800 million people are using AI-powered features each month. In the last quarter alone, customers created more than 1 million custom AI agents using Copilot Studio, highlighting rapid growth in enterprise use of AI.The company said that Indian businesses are not just experimenting with AI but are beginning to scale its use across operations, setting the stage for an AI-driven workplace model.We Reviewed U&i's Rs 599 Earbuds & Rs 949 Soundbar"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/artificial-intelligence/otter-ai-secretly-recording-private-conversations-on-zoom-gmeet-microsoft-zoom-and-other-platforms-claims-lawsuit/articleshow/123370557.cms",
    "title": "Otter AI secretly recording private conversations on Zoom, GMeet, Microsoft Zoom and other platforms; claims lawsuit",
    "content": "Image credit: Otter.aiA lawsuit filed in the US has alleged that AI-powered transcription and note-taking tool, Otter.ai, has been \"deceptively and surreptitiously\" recording private conversations from platforms like Zoom, Google Meet, and Microsoft Teams. The class-action suit claims the company uses these recordings to train its popular transcription service, Otter Notebook, without getting permission from the participants. The lawsuit, which was filed in the US District Court for the Northern District of California, alleges that the AI tool does not obtain consent from meeting attendees to record the same. It even fails to notify them that these recordings are being shared with Otter, the lawsuit highlights.The lawsuit accuses the company of doing this to \"derive financial gain,” a practice that allegedly violates state and federal privacy laws. It seeks to represent other users in California whose conversations were unknowingly shared with Otter.“In fact, if the meeting host is an Otter accountholder who has integrated their relevant Google Meet, Zoom, or Microsoft Teams accounts with Otter, an Otter Notetaker may join the meeting without obtaining the affirmative consent from any meeting participant, including the host. What Otter has done is use its Otter Notetaker meeting assistant to record, transcribe, and utilize the contents of conversations without the Class members' informed consent,” the lawsuit noted.According to a report by NPR, Otter’s privacy policy openly states that it trains its AI using meeting transcripts, but only after users give “explicit permission” by checking a box that allows Otter and third parties to process private conversations “for training and product improvement purposes.” However, the lawsuit argues that many users are still misled.In recent months, Otter has faced renewed privacy concerns as its use in workplaces continues to grow. The company says around 25 million people now rely on its AI transcription tools, which have processed over 1 billion meetings since its launch in 2016.What users said about Otter secretly recording work meetingsThe plaintiff, Justin Brewer, who is a resident of San Jacinto, claims that his privacy was “seriously violated” after discovering that Otter had recorded a confidential conversation without his knowledge. Other Users have shared negative experiences on social media platforms like X (formerly Twitter) and Reddit regarding Otter’s automated recording features.In one reported case from last year, an AI researcher and engineer alleged that Otter had recorded a Zoom meeting with investors. The user also claimed that the AI tool later sent him a transcript containing “sensitive, confidential details” of a discussion that took place after he had left the call. According to him, those disclosures contributed to a failed business deal.Similarly, another user complained about using Otter to interview a Uyghur human rights activist and later learning that the company shares user data with third parties. This raised concerns that governments, including China’s, may try to access transcripts of conversations with dissidents. Otter has stated it does not share data with foreign governments or law enforcement agencies.On Reddit, other users have reported that Otter sometimes joins meetings automatically when linked to workplace calendars, recording conversations without explicit consent.The lawsuit highlights this issue, noting that while Otter typically asks a meeting host for permission to record when an account holder joins, it does not automatically seek approval from all participants. However, Otter claimed that it anonymises meeting audio before using it to train AI, but the lawsuit challenges this claim, citing a lack of public details on the process.“Upon information and belief, Otter's deidentification process does not remove confidential information or guarantee speaker anonymity,” the lawsuit further argued.Nvidia H20 Chips for China: What’s Really Going On?"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/artificial-intelligence/softbank-group-cfo-yoshimitsu-goto-on-openais-project-stargate-we-need-to-take-our-time-to/articleshow/123173056.cms",
    "title": "SoftBank Group CFO Yoshimitsu Goto on OpenAI’s Project Stargate: ‘We need to take our time to…",
    "content": "Representative ImageSoftBank Group Corp. has announced that its $500 billion \"Stargate\" artificial intelligence project with OpenAI in the US is taking longer than expected to get underway. For the first time, the company conceded that the project is “bogging down” as it works to secure consensus among its partners. According to SoftBank’s Chief Financial Officer (CFO) Yoshimitsu Goto, SoftBank is in the process of forging a consensus with partners, including Oracle and Abu Dhabi’s MGX. SoftBank expects to begin “concrete” negotiations for its first Stargate data centre site soon.In a statement to analysts and reporters (as noted by Bloomberg), Goto said: “We need to take our time to prepare a model case for Stargate. A lot of parties are involved. Time is needed to form a consensus.”What is OpenAI’s Project Stargate and what may be slowing it downSoftBank founder Masayoshi Son and OpenAI co-founder Sam Altman introduced the Stargate initiative in January. The duo outlined the plans to start deploying $100 billion right away and eventually increase that to around $500 billion. However, progress has stalled, with no fundraising or data centre construction underway so far. According to a previous Bloomberg report from May, discussions around Stargate have slowed, influenced by market fluctuations, uncertainty around US trade policy, and concerns about the valuation of AI hardware.The company is now also in talks with Taiwan Semiconductor Manufacturing Co (TSMC) and others about potentially participating in a $1 trillion AI manufacturing project in Arizona, the report adds.Last month, OpenAI expanded its “Stargate” data centre project to Europe. The company announced plans to open a $1 billion facility in Norway in 2026.This development followed earlier remarks from Tesla and SpaceX CEO Elon Musk, who, in January, had questioned OpenAI’s financial capability to execute its large-scale infrastructure ambitions, stating the company “don’t actually have the money.”At the time, Musk also commented that “SoftBank has well under $10B secured. I have that on good authority.”Responding to Musk’s comments, OpenAI CEO Sam Altman said, “I genuinely respect your accomplishments and think you are the most inspiring entrepreneur of our time.”Despite Musk’s scepticism, OpenAI went on to announce a Stargate facility in the UAE in May and has since confirmed its first such project in Europe.Meta’s Secret AI Army: Top Talent Hired from OpenAI, Google & More"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/artificial-intelligence/netflix-reveals-first-ever-show-it-created-using-generative-ai-ceo-ted-sarandos-says-we-were-thrilled/articleshow/122771190.cms",
    "title": "Netflix reveals first-ever show created using generative AI, CEO Ted Sarandos says, ‘We were thrilled…’",
    "content": "Netflix has revealed its first-ever show that was created using generative AI. The streaming giant’s co-CEO, Ted Sarandos, said that the company was \"thrilled\" with the results. The company used the technology to reduce costs on \"The Eternaut,\" an Argentine production based on a science fiction comic. Sarandos confirmed that \"The Eternaut\" is the first Netflix title to incorporate fully AI-generated shots in its final footage. This includes a sequence depicting the collapse of a building in Buenos Aires. According to Sarandos, such an effect would not have been cost-effective for a production of \"The Eternaut's\" size without the use of AI.What Netflix co-CEO Ted Sarandos said about using AI in productionDuring Netflix's recent quarterly earnings call, Sarandos told analysts: \"In fact, that VFX sequence was completed 10 times faster than it could have been completed with visual, traditional VFX tools and workflows. The creators were thrilled with the result. We were thrilled with the result. And more importantly, the audience was thrilled with the result. So, I think these tools are helping creators expand the possibilities of storytelling on screen, and that is endlessly exciting.”This is not the first time Netflix has turned to AI for production. Previously, Sarandos has highlighted the company’s use of AI in Rodrigo Prieto’s film Pedro Páramo. He explained how it significantly reduced the cost of de-ageing effects, especially when compared to the much more expensive approach used in Martin Scorsese’s The Irishman.During Netflix's first quarter earnings call in April, Sarandos said: \"In fact, the entire budget of the film was about the VFX cost on 'The Irishman.’”Despite this, the use of AI continues to be a complex topic within Hollywood. In 2023, concerns over its use played a key role in the actors' and writers' strikes that temporarily halted production. Viewers also criticised Marvel Studios for using AI-generated credit art in Secret Invasion on Disney+. At the same time, filmmaker Tyler Perry said he delayed expanding his studio due to the capabilities AI already offers.One of the most likely areas to see changes is visual effects, especially as audience expectations for action-heavy and superhero films put pressure on production costs. As Netflix’s recent developments show, the impact of AI is extending beyond just big-budget films.Philips TAS1209 Review: Why you must get this Bluetooth Speaker"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/artificial-intelligence/yuval-noah-harari-on-risks-of-intimate-relationships-with-ai-there-could-be-unknown-benefits-but-for-now/articleshow/121626872.cms",
    "title": "Yuval Noah Harari on risks of intimate relationships with AI: 'There could be unknown benefits, but for now…’",
    "content": "Israeli historian and author Yuval Noah Harari has warned that artificial intelligence's (AI) ability to replicate intimacy can alter human relationships. The author, known for his bestselling books Sapiens and Nexus, said that, \"there could be unknown benefits, but for now, the risks far outweigh them.\" Harari suggested that while fears about job automation dominate headlines, AI's impact on intimate relationships presents a more unsettling prospect. In a recent post shared on Instagram, the author added a video clip of his discussion which was co-hosted by the Deutsches Institut für Japanstudien, Tokyo College, and Kawade Shobo. During this interview, Harari explained that AI, having already mastered language and attention, is now progressing towards mimicking intimacy, which he considers a potent human connection.What author Yuval Noah Harari said about intimate relationships with AICaptioning the Instagram post, Harari wrote: “Wouldn’t you want a partner that always gives you 100% attention and is never upset? We are facing a world where a new generation grows up with intimate relationships with AI. There could be unknown benefits – but for now, the risks far outweigh them.”In the video, he can be seen saying: “AI can replicate intimacy the same way that it masters language and the same way that it previously mastered attention. The Next Frontier is intimacy, and it is much more powerful than attention. If you want to change somebody's views on politics to sell a product, anything intimacy is the most powerful tool to do that. A good friend can change your views in a way that no number of articles in a newspaper or a book can do until today. Nothing could fake intimacy, and it was impossible in particular to mass produce intimacy.”Take a look at the Instagram post here“Now, what happens if the new generation grows up? And develops intimate relations with AIs instead of with other human beings. Again, we don't know. It could have some benefits, but the potential danger is enormous. That people will become attached to the fake people, and in the process, we lose the ability to create intimacy with real human beings. Because really, human beings are much more problematic than AIs that want to become your intimate friend,” Harari continued.“Its greatest advantage is that it has no feelings of its own. It's never upset. It's never angry. It's never tired. It can focus on you 100%. Understand exactly how you feel and create a fake sense of intimacy,” the author, who is known for exploring human evolution, technology, consciousness, and AI’s impact on our future further noted.Stay ready with these 7 essential medical gadgets as COVID cases rise"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/social/zerodha-co-founder-nikhil-kamaths-mother-shares-heartfelt-note-on-his-birthday-happiness-was-never-about-how-much-we-had-but-/articleshow/123746539.cms",
    "title": "Zerodha co-founder Nikhil Kamath’s mother shares heartfelt note on his birthday: Happiness was never about how much we had, but...",
    "content": "Zerodha co-founder Nikhil Kamath recently celebrated his 39th birthday on September 5. To mark the occasion, his mother, Revathi Kamath, took to the social media site Facebook to share a personal note and a throwback photograph. The image showed a young Nikhil next to a birthday cake, with his mother. His mother’s birthday message read: “Today my son Nikhil Kamath’s birthday and I never forget to celebrate my sons’ birthdays!!” Her remarks reflected a long-standing habit of marking her children’s milestones, no matter the circumstances. In a separate Instagram post, she also recalled the family’s earlier years, when money was often tight but birthdays were always celebrated. Sharing a short clip on Instagram that included a zoomed-out version of the same photo, she wrote: “We always made sure to celebrate both of our sons’ birthdays without fail 🎂🎉. No matter what our economic condition was at that time, we celebrated with whatever resources were available 💕.Because happiness was never about how much we had, but about how much love we shared ❤️✨” The Instagram post received several responses from social media users. One user said, “It’s never the resources but parents’ emotions that are magical. This bonding is divine.” Another noted, “Very well said, it’s all about love shared.”Later on, she also shared a short clip on Instagram that included the same photos and wrote: \"✨🎂💖 Happy Birthday my dearest younger son 💖🎂✨From the day you came into my life, you filled it with double the love, laughter, and joy. You will always remain my little boy no matter how much you grow up. I am truly blessed to be your mother and to watch you achieve, smile, and spread happiness around. 💕May your journey ahead be filled with success, good health, and endless smiles. Always remember, Amma’s love and prayers will be with you every step of the way. 🌸Stay happy, stay strong, and keep shining like you always do! 🌟Love you beyond words, my son. 🤗❤️#HappyBirthday #YoungerSon #ProudMother #EndlessLove #godblessyou\"What Nikhil Kamath’s mother said earlier about her familyRevathi Kamath has frequently shared memories of the time before her sons found business success. In a previous Facebook post, she reflected on how swiftly family life settled in after her marriage.“Within 10 months of marriage, my son Nithin was born and my life got completely dedicated to him and the family. Seven years later, Nikhil was born, and both boys were far from conventional. Every day was a challenge,” she posted.Before making his mark in the financial sector, Nikhil Kamath worked at a call centre while trading equities during his teenage years. In 2010, he and his elder brother Nithin co-founded Zerodha, which went on to become India’s largest retail brokerage.Apart from Zerodha, Nikhil co-founded True Beacon and is recognised for his role as an investor and philanthropist. More recently, he launched a podcast series where he engages in conversations with public figures and leaders.Google's Great Escape: How ChatGPT Saved the Tech Giant"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/mobiles-tabs/apple-store-goes-down-hours-before-iphone-17-launch-event/articleshow/123785911.cms",
    "title": "Apple Store goes down hours before iPhone 17 launch event",
    "content": "Apple's online store went offline, following the company's traditional pattern of taking down its retail platform ahead of major product announcements. The shutdown signals that new hardware launches are imminent at today's \"Awe Dropping\" event, scheduled to begin at 10:30 p.m. IST from Apple Park in Cupertino.The store outage comes just hours before Apple is expected to unveil its most significant iPhone redesign in years, headlined by the ultra-thin iPhone 17 Air alongside the iPhone 17, iPhone 17 Pro, and iPhone 17 Pro Max models. The company is also anticipated to announce new Apple Watch models including the Series 11 and Ultra 3, plus the long-awaited AirPods Pro 3.When visitors attempt to access Apple's online store, they're greeted with the familiar \"Be right back\" message that has become synonymous with impending product launches. The store typically remains down until shortly after new products are officially announced, when it resurfaces with updated listings and pricing.Apple \"Awe Dropping\" event: iPhone 17 Air, AirPods 3, and more expected to launchThe star of today's event is widely expected to be the iPhone 17 Air, rumoured to measure just 5.5 millimeters thick, making it significantly thinner than any previous iPhone model. This ultra-slim design represents Apple's boldest hardware gamble in years, though reports suggest it will come with trade-offs including reduced battery life and a single rear camera.The iPhone 17 Pro models are set to receive their first major redesign since 2020, featuring a dramatic camera system that spans the full width of the device's back and a return to aluminium construction after two years of titanium frames. The standard iPhone 17 is also expected to receive the 120Hz ProMotion screen, which has remained exclusive to Pro models until now.Apple is also expected to introduce new Apple Watch models with satellite texting capabilities and updated AirPods Pro 3 with heart rate monitoring features.Following Apple's typical release schedule, the new iPhones 17 models and other products will likely be available for pre-order starting Friday, with general availability later in September."
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/mobiles-tabs/google-is-removing-this-new-ai-feature-from-pixel-10-just-few-weeks-after-launch/articleshow/123790148.cms",
    "title": "Google is removing this new AI feature from Pixel 10 just few weeks after launch",
    "content": "Representative ImageGoogle has temporarily removed its new AI-enabled feature, Daily Hub, from the recently launched Pixel 10 phones. This move comes less than two weeks after the devices went on sale. The feature, which was in a \"public preview,\" collected weather and calendar events and recommended online content. Google has now confirmed that the company is \"actively working to enhance its performance and refine the personalised experience,\" a report claimed. The company plans to reintroduce “an improved Daily Hub when it’s ready.” What Google said about removing this feature In a statement to 9to5Google, a company spokesperson said: “To ensure the best possible experience on Pixel, we’re temporarily pausing the public preview of Daily Hub for users. Our teams are actively working to enhance its performance and refine the personalized experience. We look forward to reintroducing an improved Daily Hub when it’s ready.” What is Pixel 10’s new Daily Hub feature and how it workedOn the Pixel 10, Daily Hub was introduced as a central space that combined your calendar, Magic Cue, and personalised suggestions. Daily Hub debuted on the Pixel 10 lineup with a preview badge above the greeting, similar to how Pixel Studio first appeared in 2024 before graduating with its 2.0 update last month.Since Daily Hub was only in public preview, it hadn’t rolled out to every Pixel 10. Some Pixel 10 Pro XL users claimed that they haven’t received it and couldn’t access the same. The feature also surfaced media recommendations powered by the same system behind Google Play Collections. Depending on the user’s activity and preferences, this could include music, podcasts, and YouTube content. While podcast suggestions worked reasonably well, results with YouTube Shorts were less consistent.As of today, Daily Hub no longer appears at the top of the Discover feed or in At a Glance on the homescreen and lockscreen, the report claims. The final carousel in Daily Hub highlighted topics that users may want to explore or plan around. Tapping one opened the Gemini app with a detailed prompt already filled in, though the usefulness of this feature varied.Honor X9c 5G Review: Two months after"
  },
  {
    "url": "https://timesofindia.indiatimes.com/technology/audio/samsung-galaxy-buds3-fe-launched-with-real-time-translation-at-rs-12999/articleshow/123851549.cms",
    "title": "Samsung Galaxy Buds3 FE launched with real-time translation at Rs 12,999",
    "content": "Expanding its product portfolio in India, Samsung has launched the Galaxy Buds3 FE in the country. The new earbuds feature a Blade design, Galaxy AI capabilities and enhanced audio performance, with the company highlighting smarter features, better sound quality and greater comfort.Samsung Galaxy Buds3 FE featuresSamsung Galaxy Buds3 FE brings multiple upgrades including real-time translation support through the Galaxy AI Interpreter app, hands-free voice commands, and the ability to access schedules or emails without reaching for the phone. Audio has been improved with larger speakers for deeper bass and clearer treble, while Active Noise Canceling reduces background sounds for an immersive experience. Samsung has also introduced Crystal Clear Call technology that uses AI models to isolate the speaker’s voice in noisy environments.The earbuds come with an iconic Blade design that combines a matte dual-tone finish with semi-transparent accents, giving them a modern and playful aesthetic. They also offer seamless connectivity across Galaxy devices, easier pairing and app-free controls.Samsung Galaxy Buds3 FE price and availabilitySamsung Galaxy Buds3 FE is priced at Rs 12,999 and will go on sale next week. As part of launch offers, customers can get benefits worth Rs 4,000 when paired with select Galaxy smartphones, along with a Rs 3,000 bank cashback or upgrade bonus. Buyers will also have the option of no-cost EMIs for up to 12 months.Launch offers:Benefits worth Rs 4,000 when paired with select Galaxy smartphonesRs 3,000 cashback or upgrade bonusNo-cost EMI for up to 12 months"
  }
]